/*
Ask 3schools Main Js
*Copyright www.3schools.in
*Licensed code (no open source code)
*V10
*Last updated 5 July 2022

*/
var _0x20d807=_0x47d3;(function(_0x510bfb,_0x4e4f59){var _0x3a7374=_0x47d3,_0x537407=_0x510bfb();while(!![]){try{var _0x3cdfe7=parseInt(_0x3a7374(0x191))/0x1+parseInt(_0x3a7374(0x186))/0x2*(parseInt(_0x3a7374(0x15e))/0x3)+-parseInt(_0x3a7374(0x175))/0x4+-parseInt(_0x3a7374(0x174))/0x5*(-parseInt(_0x3a7374(0x18d))/0x6)+-parseInt(_0x3a7374(0x165))/0x7+-parseInt(_0x3a7374(0x176))/0x8*(parseInt(_0x3a7374(0x184))/0x9)+parseInt(_0x3a7374(0x162))/0xa;if(_0x3cdfe7===_0x4e4f59)break;else _0x537407['push'](_0x537407['shift']());}catch(_0x18a6db){_0x537407['push'](_0x537407['shift']());}}}(_0xc71d,0x262d4));let pTi=document[_0x20d807(0x15a)](_0x20d807(0x198))[_0x20d807(0x18c)][_0x20d807(0x168)]('\x20');function _0x47d3(_0x27a354,_0x41f362){var _0xc71d05=_0xc71d();return _0x47d3=function(_0x47d331,_0xe0ee0e){_0x47d331=_0x47d331-0x15a;var _0x1aaeae=_0xc71d05[_0x47d331];return _0x1aaeae;},_0x47d3(_0x27a354,_0x41f362);}function relatedRandom(_0x1c64e6){var _0x441345=_0x20d807;if(document['querySelector'](_0x441345(0x188))){var _0xb1b5dc=shuffleArray(_0x1c64e6['feed'][_0x441345(0x178)]),_0x909b40,_0x14fa1b,_0x5c5ab7='',_0x494b1c=document[_0x441345(0x15a)]('.QNAS');for(var _0x44c1c8=0x0;_0x44c1c8<_0x1c64e6[_0x441345(0x169)]['entry'][_0x441345(0x166)];_0x44c1c8++){for(var _0x47e33f=0x0;_0x47e33f<_0x1c64e6[_0x441345(0x169)][_0x441345(0x178)][_0x441345(0x166)];_0x47e33f++){if(_0xb1b5dc[_0x44c1c8][_0x441345(0x15c)][_0x47e33f][_0x441345(0x15d)]==_0x441345(0x196)){_0x14fa1b=_0xb1b5dc[_0x44c1c8][_0x441345(0x15c)][_0x47e33f]['href'];break;}}var _0x909b40=_0xb1b5dc[_0x44c1c8][_0x441345(0x16f)]['$t'];_0x5c5ab7+=_0x441345(0x177)+_0x14fa1b+_0x441345(0x16e)+_0x909b40+'\x27>'+_0x909b40+_0x441345(0x167)+_0x14fa1b+_0x441345(0x181)+_0x909b40+_0x441345(0x197);}_0x494b1c[_0x441345(0x18c)]=_0x5c5ab7;}}function qnaP(_0x18fc7c){var _0x46f74e=_0x20d807;if(document[_0x46f74e(0x15a)]('.QNA')){var _0x5470e5=shuffleArray(_0x18fc7c['feed'][_0x46f74e(0x178)]),_0x152fd9,_0xde7bf3,_0xe9667f='',_0x4579c3=document[_0x46f74e(0x15a)](_0x46f74e(0x179));for(var _0x4483c4=0x0;_0x4483c4<_0x18fc7c[_0x46f74e(0x169)][_0x46f74e(0x178)][_0x46f74e(0x166)];_0x4483c4++){for(var _0x1e3378=0x0;_0x1e3378<_0x18fc7c[_0x46f74e(0x169)][_0x46f74e(0x178)][_0x46f74e(0x166)];_0x1e3378++){if(_0x5470e5[_0x4483c4][_0x46f74e(0x15c)][_0x1e3378][_0x46f74e(0x15d)]==_0x46f74e(0x196)){_0xde7bf3=_0x5470e5[_0x4483c4][_0x46f74e(0x15c)][_0x1e3378][_0x46f74e(0x170)];break;}}var _0x152fd9=_0x5470e5[_0x4483c4]['title']['$t'];_0xe9667f+=_0x46f74e(0x18b)+_0xde7bf3+_0x46f74e(0x16e)+_0x152fd9+'\x27>'+_0x152fd9+_0x46f74e(0x167)+_0xde7bf3+'\x27\x20data-title=\x27'+_0x152fd9+_0x46f74e(0x197);}_0x4579c3[_0x46f74e(0x18c)]=_0xe9667f;}}function shuffleArray(_0x21824e){var _0x52518b=_0x20d807,_0x20896d=_0x21824e[_0x52518b(0x166)],_0x58938a,_0x195571;if(_0x20896d===0x0)return![];while(--_0x20896d){_0x58938a=Math[_0x52518b(0x195)](Math[_0x52518b(0x18f)]()*(_0x20896d+0x1)),_0x195571=_0x21824e[_0x20896d],_0x21824e[_0x20896d]=_0x21824e[_0x58938a],_0x21824e[_0x58938a]=_0x195571;}return _0x21824e;}let relR=document[_0x20d807(0x17f)](_0x20d807(0x18a));relR[_0x20d807(0x192)]='https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q='+pTi[Math[_0x20d807(0x195)](Math[_0x20d807(0x18f)]()*pTi['length'])]+'&callback=relatedRandom',document['getElementsByTagName'](_0x20d807(0x16c))[0x0][_0x20d807(0x193)](relR);let relP=document[_0x20d807(0x17f)]('script');relP[_0x20d807(0x192)]='https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q='+pTi[Math[_0x20d807(0x195)](Math[_0x20d807(0x18f)]()*pTi['length'])]+_0x20d807(0x17c),document['getElementsByTagName']('head')[0x0][_0x20d807(0x193)](relP);function addItem(_0x18497e){var _0x4db93b=_0x20d807;let _0x15c858=localStorage['getItem']('my'),_0x126b5d=[];_0x15c858&&(_0x126b5d=JSON[_0x4db93b(0x183)](_0x15c858));var _0x2a2491=new Date(),_0x458b41=_0x2a2491['getDate']()+'-'+(_0x2a2491[_0x4db93b(0x17a)]()+0x1)+'-'+_0x2a2491[_0x4db93b(0x190)](),_0x256754=_0x2a2491['getHours']()+':'+_0x2a2491[_0x4db93b(0x16d)]()+':'+_0x2a2491[_0x4db93b(0x185)]();_0x126b5d[_0x4db93b(0x16b)]({'id':_0x458b41+'\x20'+_0x256754,'title':_0x18497e['dataset']['title'],'url':_0x18497e['dataset'][_0x4db93b(0x173)]});const _0x38d82e=_0x126b5d[_0x4db93b(0x160)](_0x50dd2c=>_0x50dd2c['url']),_0x3515c1=_0x126b5d['filter'](({url:_0x56f7b4},_0x2f4259)=>!_0x38d82e[_0x4db93b(0x16a)](_0x56f7b4,_0x2f4259+0x1));localStorage[_0x4db93b(0x163)]('my',JSON[_0x4db93b(0x18e)](_0x3515c1)),addtof();}function addtof(){var _0x532222=_0x20d807;let _0x16bbc2=document[_0x532222(0x15a)]('#list');_0x16bbc2&&(_0x16bbc2[_0x532222(0x18c)]='');var _0x423828=[];let _0x51a220=localStorage[_0x532222(0x164)]('my');_0x423828=JSON[_0x532222(0x183)](_0x51a220),_0x423828[_0x532222(0x194)](function(_0x6f51e3){var _0x195326=_0x532222,_0xc768d=document[_0x195326(0x17f)]('li'),_0x1f13d2=document['createElement']('a'),_0x5a7b64=document[_0x195326(0x17f)](_0x195326(0x15f));_0x5a7b64[_0x195326(0x18c)]='<svg\x20class=\x22favoriteP\x22\x20del-date=\x22'+_0x6f51e3['id']+'\x22\x20xmlns=\x22http://www.w3.org/2000/svg\x22\x20aria-hidden=\x22true\x22\x20role=\x22img\x22\x20width=\x221em\x22\x20height=\x221em\x22\x20preserveAspectRatio=\x22xMidYMid\x20meet\x22\x20viewBox=\x220\x200\x2020\x2020\x22><path\x20fill=\x22#ff00ff\x22\x20d=\x22M8.5\x204h3a1.5\x201.5\x200\x200\x200-3\x200Zm-1\x200a2.5\x202.5\x200\x200\x201\x205\x200h5a.5.5\x200\x200\x201\x200\x201h-1.054l-1.194\x2010.344A3\x203\x200\x200\x201\x2012.272\x2018H7.728a3\x203\x200\x200\x201-2.98-2.656L3.554\x205H2.5a.5.5\x200\x200\x201\x200-1h5ZM9\x208a.5.5\x200\x200\x200-1\x200v6a.5.5\x200\x200\x200\x201\x200V8Zm2.5-.5a.5.5\x200\x200\x200-.5.5v6a.5.5\x200\x200\x200\x201\x200V8a.5.5\x200\x200\x200-.5-.5Z\x22/></svg>\x20',_0x5a7b64[_0x195326(0x182)]=_0x195326(0x161),_0x5a7b64[_0x195326(0x199)]=_0x1e6300,_0x1f13d2[_0x195326(0x170)]=_0x6f51e3[_0x195326(0x173)]+'?rel=favorite',_0x1f13d2[_0x195326(0x189)]=_0x6f51e3['title'],_0xc768d[_0x195326(0x182)]=_0x195326(0x172),_0xc768d[_0x195326(0x193)](_0x1f13d2),_0xc768d[_0x195326(0x193)](_0x5a7b64),_0x16bbc2[_0x195326(0x193)](_0xc768d);function _0x1e6300(_0x420c36){var _0x394f96=_0x195326;let _0x20a217=document[_0x394f96(0x15a)](_0x394f96(0x17b));_0x20a217['removeChild'](_0xc768d),_0x20a217['addEventListener'](_0x394f96(0x180),function(_0x436a1a){var _0x1fb266=_0x394f96,_0x4ce749=_0x436a1a[_0x1fb266(0x187)][_0x1fb266(0x17d)](_0x1fb266(0x171));let _0x1d47be=_0x423828[_0x1fb266(0x160)](_0x4e8d9e=>_0x4e8d9e['id'])[_0x1fb266(0x17e)](_0x4ce749);_0x423828[_0x1fb266(0x15b)](_0x1d47be,0x1),localStorage[_0x1fb266(0x163)]('my',JSON[_0x1fb266(0x18e)](_0x423828));});}});}addtof();function _0xc71d(){var _0x5c2264=['feed','includes','push','head','getMinutes','\x27\x20title=\x27','title','href','del-date','item-title','url','462785EoDaRe','754972ChzWjF','14888RZoujN','<li\x20class=\x27tPost\x20ni\x27><a\x20href=\x27','entry','.QNA','getMonth','#list','&callback=qnaP','getAttribute','indexOf','createElement','click','\x27\x20data-title=\x27','classList','parse','1215aWnRxy','getSeconds','32068gOliqo','target','.QNAS','text','script','<li\x20class=\x27item-title\x20ni\x27><a\x20href=\x27','innerHTML','6JZxJaG','stringify','random','getFullYear','242444wvFMEF','src','appendChild','forEach','floor','alternate','\x27\x20onclick=\x27addItem(this)\x27\x20rel=\x27bookmark\x27><svg\x20class=\x27favoriteP\x27\x20viewBox=\x270\x200\x2024\x2024\x27><path\x20d=\x27M18.4,20.8,12,16,5.6,20.8A1,1,0,0,1,4,20V4A2,2,0,0,1,6,2H18a2,2,0,0,1,2,2V20A1,1,0,0,1,18.4,20.8Z\x27></path></svg></a></li>','#rehead','onclick','querySelector','splice','link','rel','6ylvian','div','map','favoriteL','4538650zfxeAV','setItem','getItem','1572088NpwytE','length','</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27','split'];_0xc71d=function(){return _0x5c2264;};return _0xc71d();}
function record(v){
recognition.start();
recognition.onresult = event => {
  const speechToText = event.results[event.results.length - 1][0];
  let text = speechToText.transcript;
if(v!=1){
document.querySelector(".cE").innerHTML += text;
}else{

document.querySelector("#search-input").value = text;
  if (
    text.indexOf("তোমার নাম") >= 0 ||
    text.indexOf("তুমি কে") >= 0||
    text.indexOf("আপনার নাম") >= 0||
    text.indexOf("ওকে গুগল") >= 0||
    text.indexOf("হু আর ইউ") >= 0||
    text.indexOf("হোয়াট ইজ ইওর নেম") >= 0
  ) {
    speak(" ওহো, আমি নিজের পরিচয় দিতে ভুলে গেছি, হাই, আমার নাম অপু। ।।তোমার নাম কী? ");
  }else if (
    text.indexOf("হাই") >= 0 ||
    text.indexOf("হ্যালো") >= 0||
    text.indexOf("হেল্প মি") >= 0||
    text.indexOf("ওকে অপু") >= 0
  ) {
    speak(" নমস্কার ,আজ আপনাকে কিভাবে সাহায্য করতে পারি? ");
  } else if (
    text.indexOf("আমার নাম কি") >= 0 ||
    text.indexOf("আমি কে") >= 0||
    text.indexOf("আমার নাম ডাকো") >= 0||
    text.indexOf("আমার নাম বল") >= 0
  ) {
    speak("আমি তো জানি আপনার নাম কি, আপনি বলুন তো আপনার নাম কি? ");
  }
  
  else if (text.indexOf("সার্চ") >= 0) {
   
    let q = text.substr(text.indexOf("সার্চ") + 5);
speak(` আক্স থ্রি স্কুলসে সার্চ করা হল ${q}`);
    window.open(`https://ask.3schools.in/search?q=${q}`,`_self`);
  } else if (
    text.indexOf("টাইম") >= 0 ||
    text.indexOf("কয়টা বাজে") >= 0 ||
    text.indexOf("কয়টা বাজ") >=0 ||
    text.indexOf("কটা বাজ") >= 0 ||
    text.indexOf("সময়") >= 0 ||
    text.indexOf("হোয়াট ইজ দা টাইম") >=0
  ) {
    let t = currentTime();
    speak(t);
  } else if (text.indexOf("আমার নাম") >= 0) {
let name = text.substr(text.indexOf("নাম") + 3); // Split name from text
    speak(`হ্যালো...হ্যাল্লো! ${name} আশা করি আজকের দিনটা আপনার খুব ভালো  কাটছে। আমি কিভাবে সাহায্য করতে পারি ,বলুন? `);
  } else if(
    text.indexOf("ছেলে নাকি মেয়ে") >= 0 ||
    text.indexOf("কি ছেলে") >=0 ||
    text.indexOf("কি মেয়ে") >=0 ||
    text.indexOf("ছেলে না মেয়ে") >= 0 
    ) {
    speak("আপনার পরাণ যাহা চায় .....আমি তাই, আমি তাই গো,💗" );
  } else if (
    text.indexOf("গুডবাই") >= 0||
    text.indexOf("বাই") >= 0||
    text.indexOf("রাখ") >= 0 ||
    text.indexOf("ঠিক আছে ") >= 0 ||
    text.indexOf("আমি কিন্তু রেগে যাচ্ছি") >= 0 ||
    text.indexOf("চুপ") >= 0
    ){
    speak("ঠিক আছে, আমি চুপ করে যাচ্ছি!");
  } else if (
    text.indexOf("তোমার সাথে কথা বলব না") >= 0 ||
    text.indexOf("তুমি কথা বলতে পারো না।") >= 0 ||
    text.indexOf("আই হেট ইউ") >=0 ||
    text.indexOf("বেকার") >=0 ||
    text.indexOf("কোন লাভ নেই") >=0 ||
    text.indexOf("তুমি খারাপ") >= 0
  ) {
    speak(` দুঃখিত, আমি কী কিছু ভুল করে ফেলেছি? এখনো আমি পুরোপুরি সব শিখিনি।`);
  }else if (
    text.indexOf("কী পার") >=0 ||
    text.indexOf("সাহায্য কর") >=0 ||
    text.indexOf("কি কি পার") >=0 ||
    text.indexOf("কি কি করতে") >=0 ||
    text.indexOf("কি করতে পার") >=0 ||
    text.indexOf("তোমার কাজ") >=0 ||
    text.indexOf("আপনার কাজ") >=0 ||
    text.indexOf("হাউ ক্যান ইউ হেল্প") >=0 ||
    text.indexOf("হেল্প কর") >=0 
    ) {
    speak(cando());
    }
  else if (
    text.indexOf("ওপেন ইউটিউব") >=0 ||
    text.indexOf("ইউটিউব খুলুন") >=0 ||
    text.indexOf("ভিডিও") >=0 ||
    text.indexOf("ইউটিউব ওপেন করো") >=0 ||
    text.indexOf("ইউটিউব") >=0 
    ) {
    speak(`খুলছি ইউটিউব`);
    window.open(`https://youtube.com/`,`_self`);
  } else if (
    text.indexOf("ওপেন হোয়াটসঅ্যাপ") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ খুলুন") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ ওপেন করো") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ") >=0 
    ) {
    speak(`খুলছি হোয়াটসঅ্যাপ`);
    window.open(`https://api.whatsapp.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন ফেসবুক") >=0 ||
    text.indexOf("ফেসবুক খুলুন") >=0 ||
    text.indexOf("ফেসবুক ওপেন করো") >=0 ||
    text.indexOf("ফেসবুক") >=0 
    ) {
    speak(`খুলছি ফেসবুক`);
    window.open(`https://www.facebook.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন টেলিগ্রাম ") >=0 ||
    text.indexOf("টেলিগ্রাম খুলুন") >=0 ||
    text.indexOf("টেলিগ্রাম ওপেন করো") >=0 ||
    text.indexOf("টেলিগ্রাম") >=0 
    ) {
    speak(`খুলছি টেলিগ্রাম`);
    window.open(`https://www.telegram.me`,`_self`);
  } else if (
    text.indexOf("বিয়ে") >=0 ||
    text.indexOf("আমি তোমাকে ভালোবাসি") >=0 ||
    text.indexOf("আই লাভ ইউ") >=0 ||
    text.indexOf("আমার বিয়ে কবে") >=0 
    ) {
    speak(`যতই করুন বাহানা, যতই বলুন না না না, বিয়ের ফুল ফুঁটলেই বাজবে বিয়ের বাজনা`);
  } else if (
    text.indexOf("তারিখ কত") >= 0 ||
    text.indexOf("আজ কত তারিখ") >= 0 ||
    text.indexOf("বাংলা কত তারিখ") >= 0 ||
    text.indexOf("ইংলিশের কত তারিখ") >= 0 ||
    text.indexOf("ক্যালেন্ডার") >= 0 ||
    text.indexOf("আজকের তারিখ") >= 0 ||
    text.indexOf("এখন কত সাল") >= 0 ||
    text.indexOf("এখন কত খ্রিস্টাব্দ") >= 0 ||
    text.indexOf("আজকে কি বার") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("টুডে") >= 0
  ) {
    speak(currentDate());
  }else if (
    text.indexOf("সাত দিনের নাম") >= 0 ||
    text.indexOf("সপ্তাহ") >= 0 ||
    text.indexOf("রবিবার") >= 0 ||
    text.indexOf("সোমবার") >= 0
  ) {
    speak(`রবিবার,সোমবার,মঙ্গলবার,বুধবার,বৃহস্পতিবার,শুক্রবার,শনিবার`);
  }else if (
    text.indexOf("জোকস") >= 0 ||
    text.indexOf("আরও একটা") >= 0 ||
    text.indexOf("জোক") >= 0 ||
    text.indexOf("মজা") >= 0 
  ) {
    speak(jokes());
  }else if (
    text.indexOf("গাল") >= 0 ||
    text.indexOf("কুত্তা") >= 0 ||
    text.indexOf("পাদ") >= 0 ||
    text.indexOf("হারামজাদা") >= 0 ||
    text.indexOf("হারামখোর") >= 0 ||
    text.indexOf("কুত্তার") >= 0 ||
    text.indexOf("হারামি") >= 0 ||
    text.indexOf("শালা") >= 0 ||
    text.indexOf("চুদ") >= 0 ||
    text.indexOf("নোংরা") >= 0 ||
    text.indexOf("শুয়োর") >= 0
  ) {
    speak(`আমার গাল নেই তাই গালাগালি দিতে পারি না।`) ;
  }else if (
    text.indexOf("গান") >= 0 ||
    text.indexOf("মিউজিক") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("নাচ") >= 0
  ) {
    speak(`আমার গলা ঠিক নেই, তাই আজ আমি গান গাইতে পারব না।`) ;
  }
  
  else if (
    text.indexOf("শোনা") >= 0 ||
    text.indexOf("পোয়েম") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("সাইরি") >= 0 ||
    text.indexOf("কবিতা বল") >= 0 ||
    text.indexOf("ছোটোদের") >= 0
  ) {
    speak(poem());
  }else if (
    text.indexOf("আমার মন খারাপ") >= 0 ||
    text.indexOf("দুঃখে আছ") >= 0 ||
    text.indexOf("আমি ভালো নেই") >= 0
  ) {
    speak(`আমার সাধ্য থাকলে আমি আপনার সমস্ত দুঃখ শুষে নিয়ে আপনাকে আনন্দ দিয়ে ভরিয়ে দিতাম`);
  }else if (
    text.indexOf("হাউ আর ইউ") >=0 ||
    text.indexOf("আশা করি") >= 0 ||
    text.indexOf("ভালো আছ") >= 0 ||
    text.indexOf("কেমন আছ") >= 0
  ) {
    speak(`ধন্যবাদ । আমি ভালো আছি । আপনাকে কীভাবে সাহায্য করতে পারি বলুন ।`);
  } else if (
    text.indexOf("অ্যালেক্সা") >=0 ||
    text.indexOf("আলেক্সা") >= 0 ||
    text.indexOf("এলেক্স") >= 0 ||
    text.indexOf("আলেক্স") >= 0
  ) {
    speak(`অ্যালেক্সা, শুনেছি অ্যামাজনে থাকে। খুব সুন্দর গলা ওর। আমার দারুণ লাগে। `);
  }else if (
    text.indexOf("গুগল অ্যাসিস্ট্যান্ট") >=0 ||
    text.indexOf("অ্যাসিস্ট্যান্ট") >= 0 ||
    text.indexOf("গুগল এসিস্ট্যান্ট") >= 0
  ) {
    speak(`গুগল অ্যাসিস্ট্যান্ট, ও খুব বুদ্ধিমান । আমাকে নতুন কিছু শিখতে ও সাহায্য করে । আমার তো ওকে দারুণ লাগে। `);
  } else if (
    text.indexOf("কি করছো") >= 0 ||
    text.indexOf("কি হচ্ছে") >= 0 ||
    text.indexOf("কি চলছে") >= 0 ||
    text.indexOf("কি করেন") >= 0 ||
    text.indexOf("কি করছি") >= 0 ||
    text.indexOf("ফাঁকা আছ") >= 0 
  ) {
    speak(whatdo());
  }else if (
    text.indexOf("ধন্যবাদ") >= 0 ||
    text.indexOf("খুব ভালো") >= 0 ||
    text.indexOf("থ্যাংক ইউ") >= 0 ||
    text.indexOf("বুদ্ধিমান") >= 0 ||
    text.indexOf("থ্যাঙ্ক ইউ") >= 0 ||
    text.indexOf("ভালো লাগলো") >= 0 
  ) {
    speak(thankyou());
  }
  
  else {
    speak(`আক্স থ্রি স্কুলসে আমি এইগুলো খুজে পেয়েছি`);
    document.querySelector("#search-form").submit();
  }
};

}
}
function currentTime() {
  let date = new Date();
  return `এখন সময় ${date.getHours()} ${date.getMinutes()} ${
    date.getHours() >= 12 ? "PM" : "AM"
  }`;
}
function currentDate(){
 const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];
 //const days = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"];
 const days = ["রবিবার","সোমবার","মঙ্গলবার","বুধবার","বৃহস্পতিবার","শুক্রবার","শনিবার"];
 let d = new Date();
 return `আজকে ${days[d.getDay()]} , ${d.getDate()} ${monthNames[d.getMonth()]}, ${d.getFullYear()}`;
}
function jokes(){
   const joke = [
    "কোন রসগোল্লা একেবারে মিষ্টি নয়? পরীক্ষার খাতায় পাওয়া রসগোল্লা।", 
    "শিক্ষক ছাত্রকে বললেন - জানো, বই কত পবিত্র জিনিস? ছাত্র বললো, জানি বৈকি স্যার , তাই তো সবসময় স্পর্শ,করি না। ", 
    "রেজাল্ট বেরোনোর পরে খুব রেগে গিয়ে মা ডাবলুকে বললেন, পাশের বাড়ির মেয়েটাকে দ্যাখ, প্রত্যেকবার ক্লাসে ফাস্ট হয়। ডাবলু বললো, ওকে রোজ দেখতে গিয়েই তো আমি ফেল করলাম। ", 
    ]
    return `${joke[Math.floor(Math.random()*joke.length)]}`;
}
function poem(){
  const poems = [
    "আমাদের ছোট নদী- রবীন্দ্রনাথ ঠাকুর , আমাদের ছোটো নদী চলে আঁকে বাঁকে বৈশাখ মাসে তার হাঁটু জল থাকে। পার হয়ে যায় গোরু, পার হয় গাড়ি, দুই ধার উঁচু তার, ঢালু তার পাড়ি।", 
    " আকাশ ঘিরে মেঘ করেছে ,সূর্যি গেছে পাঠে ।খুকু গেলো জল আনিতে পদ্মা দীঘির ঘাটে।পদ্মা দীঘির কালো জলে হরেক রকম ফুল। হাঁটুর নিচে ঝুলছে খুকুর গোছা ভরা চুল।", 
    " বনে থাকে বাঘ । গাছে থাকে পাখি । জলে থাকে মাছ । ডালে আছে ফল । পাখি ফল খায় । পাখা মেলে ওড়ে যায়।  ", 
    "ছয়টি ঋতু, বারো মাসে, বাংলা বর্ষে যায় আর আসে। ছয় ঋতুতেই এই প্রকৃতি, সাজে নানান রূপ আর রসে। ",
    "হাট্টিমাটিম টিম। তারা মাঠে পাড়ে ডিম, তাদের খাড়া দুটো শিং, তারা হাট্টিমাটিম টিম।",
    "টুইংকল টুইংকল লিটল স্টার, হাউ আর ওয়ান্ডার হোয়াট ইউ আর। আপ এভাব দ্যা ওয়ার্ল্ড সো হাই। লাইক এ ডায়মন্ড ইন দ্যা স্কাই", 
    ]
    return `${poems[Math.floor(Math.random()*poems.length)]}`;
}
function whatdo(){
   const whatdo = [
    "নিজের রসিকতায় নিজেই হাসছি, ভাবছি আরও কিছু জোকস পড়ব ।", 
    "আমি কিছু ইন্টারেস্টিং তথ্য নিয়ে পড়াশোনা করে নিজের জ্ঞান বাড়াচ্ছি। ", 
    "আপনার সাথে আড্ডা মারবো ভাবছিলাম। ", 
    ]
    return `${whatdo[Math.floor(Math.random()*whatdo.length)]}`;
}
function cando(){
   const cando = [
    "আমি আপনাকে প্রশ্ন ও উত্তর সন্ধান করতে সাহায্য করতে পারি।", 
    "আমাকে শুধু মাত্র বলে দেখুন, এখন কটা বাজছে, আজকে কি বার , একটা জোক শোনাও ,ইত্যাদি । ", 
    "আপনি চাইলে, আমি আপনার সাথে আড্ডা মারতেও পারি। ", 
    ]
    return `${cando[Math.floor(Math.random()*cando.length)]}`;
}
function thankyou(){
   const thank = [
    "ওউওউওউ, ধন্যবাদের কী আছে, এটাই তো আমার কাজ।", 
    "বন্ধুকে কি কেউ ধন্যবাদ দেয়। ", 
    "আপনাকে সাহায্য করতে পেরে আমি খুব খুশি। ", 
    ]
    return `${thank[Math.floor(Math.random()*thank.length)]}`;
}

function speak(text) {
  recognition.stop();
  let msg = new SpeechSynthesisUtterance(text);
  window.speechSynthesis.speak(msg);
  return;
}
