/*
Ask 3schools Main Js
*Copyright www.3schools.in
*Licensed code (no open source code)
*V10
*Last updated 5 August 2022

*/
const _0x320dfd=_0x5ec9;(function(_0x506189,_0x2a8799){const _0x5249ae=_0x5ec9,_0x4e175c=_0x506189();while(!![]){try{const _0x404239=parseInt(_0x5249ae(0x149))/0x1+parseInt(_0x5249ae(0x14c))/0x2+parseInt(_0x5249ae(0x11d))/0x3*(parseInt(_0x5249ae(0x10d))/0x4)+-parseInt(_0x5249ae(0x13c))/0x5*(parseInt(_0x5249ae(0x136))/0x6)+parseInt(_0x5249ae(0x157))/0x7*(-parseInt(_0x5249ae(0x114))/0x8)+parseInt(_0x5249ae(0x156))/0x9+-parseInt(_0x5249ae(0x14b))/0xa*(parseInt(_0x5249ae(0x10a))/0xb);if(_0x404239===_0x2a8799)break;else _0x4e175c['push'](_0x4e175c['shift']());}catch(_0x427756){_0x4e175c['push'](_0x4e175c['shift']());}}}(_0x34ce,0xaace9));const _0x550782=(function(){let _0x5ee90e=!![];return function(_0x127395,_0x310372){const _0x37ae12=_0x5ee90e?function(){const _0x1d52d3=_0x5ec9;if(_0x310372){const _0x506d95=_0x310372[_0x1d52d3(0x137)](_0x127395,arguments);return _0x310372=null,_0x506d95;}}:function(){};return _0x5ee90e=![],_0x37ae12;};}()),_0x367667=_0x550782(this,function(){const _0x49274e=_0x5ec9;return _0x367667[_0x49274e(0x118)]()[_0x49274e(0x120)](_0x49274e(0x151))[_0x49274e(0x118)]()[_0x49274e(0x121)](_0x367667)['search'](_0x49274e(0x151));});_0x367667();const _0xb79809=(function(){let _0x301902=!![];return function(_0x377418,_0x585c8f){const _0x4197d8=_0x301902?function(){const _0x4bb3c4=_0x5ec9;if(_0x585c8f){const _0x4a8f75=_0x585c8f[_0x4bb3c4(0x137)](_0x377418,arguments);return _0x585c8f=null,_0x4a8f75;}}:function(){};return _0x301902=![],_0x4197d8;};}()),_0x13cb3b=_0xb79809(this,function(){const _0x18400e=_0x5ec9,_0x395ab3=function(){const _0x1b5c35=_0x5ec9;let _0x3816d6;try{_0x3816d6=Function(_0x1b5c35(0x140)+_0x1b5c35(0x132)+');')();}catch(_0x2d63c4){_0x3816d6=window;}return _0x3816d6;},_0x4bb891=_0x395ab3(),_0x4ce979=_0x4bb891['console']=_0x4bb891['console']||{},_0x5c09ff=['log','warn',_0x18400e(0x152),_0x18400e(0x13d),_0x18400e(0x130),_0x18400e(0x139),_0x18400e(0x105)];for(let _0x3cb437=0x0;_0x3cb437<_0x5c09ff['length'];_0x3cb437++){const _0x3805a6=_0xb79809[_0x18400e(0x121)][_0x18400e(0x11a)][_0x18400e(0x122)](_0xb79809),_0x13df10=_0x5c09ff[_0x3cb437],_0x4b30f2=_0x4ce979[_0x13df10]||_0x3805a6;_0x3805a6[_0x18400e(0x112)]=_0xb79809[_0x18400e(0x122)](_0xb79809),_0x3805a6['toString']=_0x4b30f2['toString'][_0x18400e(0x122)](_0x4b30f2),_0x4ce979[_0x13df10]=_0x3805a6;}});_0x13cb3b();let pTi=document[_0x320dfd(0x115)](_0x320dfd(0x13a))['innerHTML'][_0x320dfd(0x10f)]('\x20');function relatedRandom(_0x13d29f){const _0x5b3458=_0x320dfd;if(document['querySelector'](_0x5b3458(0x133))){var _0x241a65=shuffleArray(_0x13d29f['feed']['entry']),_0x1c8c85,_0x4efef6,_0x14897c='',_0x135401=document[_0x5b3458(0x115)](_0x5b3458(0x133));for(var _0x5559ca=0x0;_0x5559ca<_0x13d29f[_0x5b3458(0x14e)]['entry'][_0x5b3458(0x119)];_0x5559ca++){_0x4efef6=_0x241a65[_0x5559ca]['link'][0x4][_0x5b3458(0x109)],_0x1c8c85=_0x241a65[_0x5559ca][_0x5b3458(0x126)]['$t'],_0x14897c+='<li\x20class=\x27tPost\x20ni\x27><a\x20href=\x27'+_0x4efef6+_0x5b3458(0x127)+_0x1c8c85+'\x27>'+_0x1c8c85+_0x5b3458(0x141)+_0x4efef6+_0x5b3458(0x125)+_0x1c8c85+_0x5b3458(0x106);}_0x135401[_0x5b3458(0x117)]=_0x14897c;}}function qnaP(_0xc1ef5d){const _0x651b4e=_0x320dfd;if(document[_0x651b4e(0x115)](_0x651b4e(0x12b))){var _0x3dfcfd=shuffleArray(_0xc1ef5d['feed']['entry']),_0x224b60,_0x3fd7d5,_0x29bd77='',_0x4e52f5=document['querySelector'](_0x651b4e(0x12b));for(var _0x35287=0x0;_0x35287<_0xc1ef5d['feed'][_0x651b4e(0x11f)]['length'];_0x35287++){_0x3fd7d5=_0x3dfcfd[_0x35287][_0x651b4e(0x14a)][0x4][_0x651b4e(0x109)],_0x224b60=_0x3dfcfd[_0x35287][_0x651b4e(0x126)]['$t'],_0x29bd77+=_0x651b4e(0x148)+_0x3fd7d5+_0x651b4e(0x127)+_0x224b60+'\x27>'+_0x224b60+_0x651b4e(0x141)+_0x3fd7d5+_0x651b4e(0x125)+_0x224b60+_0x651b4e(0x106);}_0x4e52f5['innerHTML']=_0x29bd77;}}function shuffleArray(_0xdb3247){const _0x1c347a=_0x320dfd;var _0x96ed2b=_0xdb3247['length'],_0x49b66f,_0x5e9e7c;if(_0x96ed2b===0x0)return![];while(--_0x96ed2b){_0x49b66f=Math[_0x1c347a(0x14d)](Math[_0x1c347a(0x153)]()*(_0x96ed2b+0x1)),_0x5e9e7c=_0xdb3247[_0x96ed2b],_0xdb3247[_0x96ed2b]=_0xdb3247[_0x49b66f],_0xdb3247[_0x49b66f]=_0x5e9e7c;}return _0xdb3247;}let relR=document[_0x320dfd(0x145)](_0x320dfd(0x12d));relR[_0x320dfd(0x11c)]=_0x320dfd(0x142)+pTi[Math[_0x320dfd(0x14d)](Math['random']()*pTi[_0x320dfd(0x119)])]+_0x320dfd(0x147),document[_0x320dfd(0x135)](_0x320dfd(0x128))[0x0][_0x320dfd(0x154)](relR);let relP=document[_0x320dfd(0x145)](_0x320dfd(0x12d));function _0x5ec9(_0xe947e5,_0x33bfb4){const _0x5b5383=_0x34ce();return _0x5ec9=function(_0x13cb3b,_0xb79809){_0x13cb3b=_0x13cb3b-0x105;let _0x5b5a1d=_0x5b5383[_0x13cb3b];return _0x5b5a1d;},_0x5ec9(_0xe947e5,_0x33bfb4);}relP[_0x320dfd(0x11c)]='https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q='+pTi[Math['floor'](Math[_0x320dfd(0x153)]()*pTi[_0x320dfd(0x119)])]+'&callback=qnaP',document[_0x320dfd(0x135)](_0x320dfd(0x128))[0x0][_0x320dfd(0x154)](relP);class CartItem{constructor(_0x1d1442,_0x10997a){this['url']=_0x1d1442,this['title']=_0x10997a;}}function _0x34ce(){const _0xea52e8=['split','data-title','addItemToLocalCart','__proto__','fromEntries','1067032BLukXD','querySelector','addEventListener','innerHTML','toString','length','prototype','item-title','src','15JhSQFq','entries','entry','search','constructor','bind','clear','parse','\x27\x20data-title=\x27','title','\x27\x20title=\x27','head','stringify','setProperty','.QNA','getAttribute','script','setItem','#list','exception','add','{}.constructor(\x22return\x20this\x22)(\x20)','.QNAS','url','getElementsByTagName','6kZdTbS','apply','cartItems','table','.post-title','classList','4946180kyTOgh','error','DOMContentLoaded','click','return\x20(function()\x20','</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27','https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q=','lastElementChild','data-url','createElement','has','&callback=relatedRandom','<li\x20class=\x27item-title\x20ni\x27><a\x20href=\x27','1374478XOuyGf','link','300vsYunM','810752QMXnOs','floor','feed','querySelectorAll','remove','(((.+)+)+)+$','info','random','appendChild','style','12512034TMxHfx','7Qtpdcl','trace','\x27\x20onclick=\x27addItem(this)\x27\x20rel=\x27bookmark\x27><svg\x20class=\x27favoriteP\x27\x20viewBox=\x270\x200\x2024\x2024\x27><path\x20d=\x27M18.4,20.8,12,16,5.6,20.8A1,1,0,0,1,4,20V4A2,2,0,0,1,6,2H18a2,2,0,0,1,2,2V20A1,1,0,0,1,18.4,20.8Z\x27></path></svg></a></li>','removeItemFromCart','append','href','998723sPbdYy','.t-fp','delete','1100760TImtzF','key'];_0x34ce=function(){return _0xea52e8;};return _0x34ce();}class LocalCart{static [_0x320dfd(0x10e)]=_0x320dfd(0x138);static['getLocalCartItems'](){const _0x246511=_0x320dfd;let _0x27c403=new Map();const _0x310972=localStorage['getItem'](LocalCart[_0x246511(0x10e)]);if(_0x310972===null||_0x310972[_0x246511(0x119)]===0x0)return _0x27c403;return new Map(Object['entries'](JSON[_0x246511(0x124)](_0x310972)));}static[_0x320dfd(0x111)](_0x1f7014,_0x12b4c4){const _0x4c5b40=_0x320dfd;let _0x4eeab5=LocalCart['getLocalCartItems']();if(_0x4eeab5[_0x4c5b40(0x146)](_0x1f7014)){}else _0x4eeab5['set'](_0x1f7014,_0x12b4c4);localStorage[_0x4c5b40(0x12e)](LocalCart[_0x4c5b40(0x10e)],JSON[_0x4c5b40(0x129)](Object[_0x4c5b40(0x113)](_0x4eeab5))),updateCartUI();}static[_0x320dfd(0x107)](_0x327c74){const _0x305dd2=_0x320dfd;let _0xfba2c8=LocalCart['getLocalCartItems']();_0xfba2c8['has'](_0x327c74)&&_0xfba2c8[_0x305dd2(0x10c)](_0x327c74);if(_0xfba2c8[_0x305dd2(0x119)]===0x0)localStorage[_0x305dd2(0x123)]();else localStorage[_0x305dd2(0x12e)](LocalCart[_0x305dd2(0x10e)],JSON[_0x305dd2(0x129)](Object[_0x305dd2(0x113)](_0xfba2c8)));updateCartUI();}}const cartIcon=document[_0x320dfd(0x14f)](_0x320dfd(0x10b));function addItem(_0x49c4ff){const _0x171748=_0x320dfd,_0x1f9848=_0x49c4ff[_0x171748(0x12c)](_0x171748(0x144)),_0x20d6da=_0x49c4ff['getAttribute'](_0x171748(0x110)),_0x48f21a=new CartItem(_0x1f9848,_0x20d6da);LocalCart[_0x171748(0x111)](_0x1f9848,_0x48f21a);}function updateCartUI(){const _0x7dd197=_0x320dfd,_0xddfbeb=document[_0x7dd197(0x115)](_0x7dd197(0x12f));_0xddfbeb[_0x7dd197(0x117)]='';const _0x3607a2=LocalCart['getLocalCartItems']();if(_0x3607a2===null)return;let _0x4964d2=0x0;for(const [_0x57c093,_0x5bfa95]of _0x3607a2[_0x7dd197(0x11e)]()){const _0x5013b9=document[_0x7dd197(0x145)]('li');_0x5013b9[_0x7dd197(0x13b)][_0x7dd197(0x131)](_0x7dd197(0x11b)),_0x4964d2+=0x1,_0x5013b9['innerHTML']='\x0a\x20\x20\x20\x20\x20\x20\x20\x20<a\x20href=\x22'+_0x5bfa95[_0x7dd197(0x134)]+'\x22>'+_0x5bfa95[_0x7dd197(0x126)]+'</a>\x0a\x20\x20\x20\x20\x20\x20\x20\x20<div\x20class=\x22favoriteL\x22><svg\x20class=\x22favoriteP\x22\x20xmlns=\x22http://www.w3.org/2000/svg\x22\x20aria-hidden=\x22true\x22\x20role=\x22img\x22\x20preserveAspectRatio=\x22xMidYMid\x20meet\x22\x20viewBox=\x220\x200\x2020\x2020\x22><path\x20fill=\x22#ff00ff\x22\x20d=\x22M8.5\x204h3a1.5\x201.5\x200\x200\x200-3\x200Zm-1\x200a2.5\x202.5\x200\x200\x201\x205\x200h5a.5.5\x200\x200\x201\x200\x201h-1.054l-1.194\x2010.344A3\x203\x200\x200\x201\x2012.272\x2018H7.728a3\x203\x200\x200\x201-2.98-2.656L3.554\x205H2.5a.5.5\x200\x200\x201\x200-1h5ZM9\x208a.5.5\x200\x200\x200-1\x200v6a.5.5\x200\x200\x200\x201\x200V8Zm2.5-.5a.5.5\x200\x200\x200-.5.5v6a.5.5\x200\x200\x200\x201\x200V8a.5.5\x200\x200\x200-.5-.5Z\x22/></svg>\x20</div>\x0a\x20\x20\x20\x20\x20\x20\x20',_0x5013b9[_0x7dd197(0x143)][_0x7dd197(0x116)](_0x7dd197(0x13f),()=>{const _0xb515d4=_0x7dd197;LocalCart[_0xb515d4(0x107)](_0x57c093);}),_0xddfbeb[_0x7dd197(0x108)](_0x5013b9);}if(_0x4964d2>0x0){cartIcon['forEach'](_0x392574=>{const _0x3070a7=_0x7dd197;_0x392574[_0x3070a7(0x13b)]['add']('non-empty');});let _0x203159=document[_0x7dd197(0x115)](':root');_0x203159[_0x7dd197(0x155)][_0x7dd197(0x12a)]('--after-content','\x22'+_0x4964d2+'\x22');}else cartIcon['forEach'](_0x1f29c0=>{const _0x10713c=_0x7dd197;_0x1f29c0['classList'][_0x10713c(0x150)]('non-empty');});}document['addEventListener'](_0x320dfd(0x13e),()=>{updateCartUI();});
function record(v){
recognition.start();
recognition.onresult = event => {
  const speechToText = event.results[event.results.length - 1][0];
  let text = speechToText.transcript;
if(v!=1){
document.querySelector(".cE").innerHTML += text;
}else{

document.querySelector("#search-input").value = text;
  if (
    text.indexOf("তোমার নাম") >= 0 ||
    text.indexOf("তুমি কে") >= 0||
    text.indexOf("আপনার নাম") >= 0||
    text.indexOf("ওকে গুগল") >= 0||
    text.indexOf("হু আর ইউ") >= 0||
    text.indexOf("হোয়াট ইজ ইওর নেম") >= 0
  ) {
    speak(" ওহো, আমি নিজের পরিচয় দিতে ভুলে গেছি, হাই, আমার নাম অপু। ।।তোমার নাম কী? ");
  }else if (
    text.indexOf("হাই") >= 0 ||
    text.indexOf("হ্যালো") >= 0||
    text.indexOf("হেল্প মি") >= 0||
    text.indexOf("ওকে অপু") >= 0
  ) {
    speak(" নমস্কার ,আজ আপনাকে কিভাবে সাহায্য করতে পারি? ");
  } else if (
    text.indexOf("আমার নাম কি") >= 0 ||
    text.indexOf("আমি কে") >= 0||
    text.indexOf("আমার নাম ডাকো") >= 0||
    text.indexOf("আমার নাম বল") >= 0
  ) {
    speak("আমি তো জানি আপনার নাম কি, আপনি বলুন তো আপনার নাম কি? ");
  }
  
  else if (text.indexOf("সার্চ") >= 0) {
   
    let q = text.substr(text.indexOf("সার্চ") + 5);
speak(` আক্স থ্রি স্কুলসে সার্চ করা হল ${q}`);
    window.open(`https://ask.3schools.in/search?q=${q}`,`_self`);
  }
  else if (
    text.indexOf("নাইট মোড") >=0 ||
    text.indexOf("লাইট মোড") >=0 ||
    text.indexOf("ডার্ক মোড") >=0 ||
    text.indexOf("ডার্কমোড") >=0 ||
    text.indexOf("ডার্ক নাইট") >=0 ||
    text.indexOf("ব্লাক মোড") >=0 ||
    text.indexOf("চোখ খারাপ") >=0 
    ) {
    speak(`ঠিক আছে, করে দিচ্ছি। `);
    window.open(`https://ask.3schools.in/p/result.html`,`_self`);
  } 
  else if (
    text.indexOf("ফ্লাসলাইট") >=0 ||
    text.indexOf("লাইট অন") >=0 ||
    text.indexOf("লাইট অফ") >=0 ||
    text.indexOf("ফ্ল্যাস লাইট") >=0 ||
    text.indexOf("ফ্ল্যাস অফ") >=0 ||
    text.indexOf("টচ") >=0 ||
    text.indexOf("টর্চ") >=0 ||
    text.indexOf("লাইট জ্বা") >=0 ||
    text.indexOf("ফ্ল্যাস অন") >=0 
    ) {
    speak(`করে দিচ্ছি।`);
    window.open(`https://ask.3schools.in/p/flash.html`,`_self`);
  }
  else if (
    text.indexOf("টাইম") >= 0 ||
    text.indexOf("কয়টা বাজে") >= 0 ||
    text.indexOf("কয়টা বাজ") >=0 ||
    text.indexOf("কটা বাজ") >= 0 ||
    text.indexOf("সময়") >= 0 ||
    text.indexOf("হোয়াট ইজ দা টাইম") >=0
  ) {
    let t = currentTime();
    speak(t);
  } else if (text.indexOf("আমার নাম") >= 0) {
let name = text.substr(text.indexOf("নাম") + 3); // Split name from text
    speak(`হ্যালো...হ্যাল্লো! ${name} আশা করি আজকের দিনটা আপনার খুব ভালো  কাটছে। আমি কিভাবে সাহায্য করতে পারি ,বলুন? `);
  } else if(
    text.indexOf("ছেলে নাকি মেয়ে") >= 0 ||
    text.indexOf("কি ছেলে") >=0 ||
    text.indexOf("কি মেয়ে") >=0 ||
    text.indexOf("ছেলে না মেয়ে") >= 0 
    ) {
    speak("আপনার পরাণ যাহা চায় .....আমি তাই, আমি তাই গো,💗" );
  } else if (
    text.indexOf("গুডবাই") >= 0||
    text.indexOf("বাই") >= 0||
    text.indexOf("রাখ") >= 0 ||
    text.indexOf("ঠিক আছে ") >= 0 ||
    text.indexOf("আমি কিন্তু রেগে যাচ্ছি") >= 0 ||
    text.indexOf("চুপ") >= 0
    ){
    speak("ঠিক আছে, আমি চুপ করে যাচ্ছি!");
  } else if (
    text.indexOf("তোমার সাথে কথা বলব না") >= 0 ||
    text.indexOf("তুমি কথা বলতে পারো না।") >= 0 ||
    text.indexOf("আই হেট ইউ") >=0 ||
    text.indexOf("বেকার") >=0 ||
    text.indexOf("কোন লাভ নেই") >=0 ||
    text.indexOf("তুমি খারাপ") >= 0
  ) {
    speak(` দুঃখিত, আমি কী কিছু ভুল করে ফেলেছি? এখনো আমি পুরোপুরি সব শিখিনি।`);
  }else if (
    text.indexOf("কী পার") >=0 ||
    text.indexOf("সাহায্য কর") >=0 ||
    text.indexOf("কি কি পার") >=0 ||
    text.indexOf("কি কি করতে") >=0 ||
    text.indexOf("কি করতে পার") >=0 ||
    text.indexOf("তোমার কাজ") >=0 ||
    text.indexOf("আপনার কাজ") >=0 ||
    text.indexOf("হাউ ক্যান ইউ হেল্প") >=0 ||
    text.indexOf("হেল্প কর") >=0 
    ) {
    speak(cando());
    }
  else if (
    text.indexOf("ওপেন ইউটিউব") >=0 ||
    text.indexOf("ইউটিউব খুলুন") >=0 ||
    text.indexOf("ভিডিও") >=0 ||
    text.indexOf("ইউটিউব ওপেন করো") >=0 ||
    text.indexOf("ইউটিউব") >=0 
    ) {
    speak(`খুলছি ইউটিউব`);
    window.open(`https://youtube.com/`,`_self`);
  } else if (
    text.indexOf("ওপেন হোয়াটসঅ্যাপ") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ খুলুন") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ ওপেন করো") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ") >=0 
    ) {
    speak(`খুলছি হোয়াটসঅ্যাপ`);
    window.open(`https://api.whatsapp.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন ফেসবুক") >=0 ||
    text.indexOf("ফেসবুক খুলুন") >=0 ||
    text.indexOf("ফেসবুক ওপেন করো") >=0 ||
    text.indexOf("ফেসবুক") >=0 
    ) {
    speak(`খুলছি ফেসবুক`);
    window.open(`https://www.facebook.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন টেলিগ্রাম ") >=0 ||
    text.indexOf("টেলিগ্রাম খুলুন") >=0 ||
    text.indexOf("টেলিগ্রাম ওপেন করো") >=0 ||
    text.indexOf("টেলিগ্রাম") >=0 
    ) {
    speak(`খুলছি টেলিগ্রাম`);
    window.open(`https://www.telegram.me`,`_self`);
  } else if (
    text.indexOf("বিয়ে") >=0 ||
    text.indexOf("আমি তোমাকে ভালোবাসি") >=0 ||
    text.indexOf("আই লাভ ইউ") >=0 ||
    text.indexOf("আমার বিয়ে কবে") >=0 
    ) {
    speak(`যতই করুন বাহানা, যতই বলুন না না না, বিয়ের ফুল ফুঁটলেই বাজবে বিয়ের বাজনা`);
  } else if (
    text.indexOf("তারিখ কত") >= 0 ||
    text.indexOf("আজ কত তারিখ") >= 0 ||
    text.indexOf("বাংলা কত তারিখ") >= 0 ||
    text.indexOf("ইংলিশের কত তারিখ") >= 0 ||
    text.indexOf("ক্যালেন্ডার") >= 0 ||
    text.indexOf("আজকের তারিখ") >= 0 ||
    text.indexOf("এখন কত সাল") >= 0 ||
    text.indexOf("এখন কত খ্রিস্টাব্দ") >= 0 ||
    text.indexOf("আজকে কি বার") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("টুডে") >= 0
  ) {
    speak(currentDate());
  }else if (
    text.indexOf("সাত দিনের নাম") >= 0 ||
    text.indexOf("সপ্তাহ") >= 0 ||
    text.indexOf("রবিবার") >= 0 ||
    text.indexOf("সোমবার") >= 0
  ) {
    speak(`রবিবার,সোমবার,মঙ্গলবার,বুধবার,বৃহস্পতিবার,শুক্রবার,শনিবার`);
  }else if (
    text.indexOf("জোকস") >= 0 ||
    text.indexOf("আরও একটা") >= 0 ||
    text.indexOf("জোক") >= 0 ||
    text.indexOf("মজা") >= 0 
  ) {
    speak(jokes());
  }else if (
    text.indexOf("গাল") >= 0 ||
    text.indexOf("কুত্তা") >= 0 ||
    text.indexOf("পাদ") >= 0 ||
    text.indexOf("হারামজাদা") >= 0 ||
    text.indexOf("হারামখোর") >= 0 ||
    text.indexOf("কুত্তার") >= 0 ||
    text.indexOf("হারামি") >= 0 ||
    text.indexOf("শালা") >= 0 ||
    text.indexOf("চুদ") >= 0 ||
    text.indexOf("নোংরা") >= 0 ||
    text.indexOf("শুয়োর") >= 0
  ) {
    speak(`আমার গাল নেই তাই গালাগালি দিতে পারি না।`) ;
  }else if (
    text.indexOf("গান") >= 0 ||
    text.indexOf("মিউজিক") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("নাচ") >= 0
  ) {
    speak(`আমার গলা ঠিক নেই, তাই আজ আমি গান গাইতে পারব না।`) ;
  }
  
  else if (
    text.indexOf("শোনা") >= 0 ||
    text.indexOf("পোয়েম") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("সাইরি") >= 0 ||
    text.indexOf("কবিতা বল") >= 0 ||
    text.indexOf("ছোটোদের") >= 0
  ) {
    speak(poem());
  }else if (
    text.indexOf("আমার মন খারাপ") >= 0 ||
    text.indexOf("দুঃখে আছ") >= 0 ||
    text.indexOf("আমি ভালো নেই") >= 0
  ) {
    speak(`আমার সাধ্য থাকলে আমি আপনার সমস্ত দুঃখ শুষে নিয়ে আপনাকে আনন্দ দিয়ে ভরিয়ে দিতাম`);
  }else if (
    text.indexOf("হাউ আর ইউ") >=0 ||
    text.indexOf("আশা করি") >= 0 ||
    text.indexOf("ভালো আছ") >= 0 ||
    text.indexOf("কেমন আছ") >= 0
  ) {
    speak(`ধন্যবাদ । আমি ভালো আছি । আপনাকে কীভাবে সাহায্য করতে পারি বলুন ।`);
  } else if (
    text.indexOf("অ্যালেক্সা") >=0 ||
    text.indexOf("আলেক্সা") >= 0 ||
    text.indexOf("এলেক্স") >= 0 ||
    text.indexOf("আলেক্স") >= 0
  ) {
    speak(`অ্যালেক্সা, শুনেছি অ্যামাজনে থাকে। খুব সুন্দর গলা ওর। আমার দারুণ লাগে। `);
  }else if (
    text.indexOf("গুগল অ্যাসিস্ট্যান্ট") >=0 ||
    text.indexOf("অ্যাসিস্ট্যান্ট") >= 0 ||
    text.indexOf("গুগল এসিস্ট্যান্ট") >= 0
  ) {
    speak(`গুগল অ্যাসিস্ট্যান্ট, ও খুব বুদ্ধিমান । আমাকে নতুন কিছু শিখতে ও সাহায্য করে । আমার তো ওকে দারুণ লাগে। `);
  } else if (
    text.indexOf("কি করছো") >= 0 ||
    text.indexOf("কি হচ্ছে") >= 0 ||
    text.indexOf("কি চলছে") >= 0 ||
    text.indexOf("কি করেন") >= 0 ||
    text.indexOf("কি করছি") >= 0 ||
    text.indexOf("ফাঁকা আছ") >= 0 
  ) {
    speak(whatdo());
  }else if (
    text.indexOf("ধন্যবাদ") >= 0 ||
    text.indexOf("খুব ভালো") >= 0 ||
    text.indexOf("থ্যাংক ইউ") >= 0 ||
    text.indexOf("বুদ্ধিমান") >= 0 ||
    text.indexOf("থ্যাঙ্ক ইউ") >= 0 ||
    text.indexOf("ভালো লাগলো") >= 0 
  ) {
    speak(thankyou());
  }
  
  else {
    speak(`আক্স থ্রি স্কুলসে আমি এইগুলো খুজে পেয়েছি`);
    document.querySelector("#search-form").submit();
  }
};

}
}
function currentTime() {
  let date = new Date();
  return `এখন সময় ${date.getHours()} ${date.getMinutes()} ${
    date.getHours() >= 12 ? "PM" : "AM"
  }`;
}
function currentDate(){
 const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];
 //const days = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"];
 const days = ["রবিবার","সোমবার","মঙ্গলবার","বুধবার","বৃহস্পতিবার","শুক্রবার","শনিবার"];
 let d = new Date();
 return `আজকে ${days[d.getDay()]} , ${d.getDate()} ${monthNames[d.getMonth()]}, ${d.getFullYear()}`;
}
function jokes(){
   const joke = [
    "কোন রসগোল্লা একেবারে মিষ্টি নয়? পরীক্ষার খাতায় পাওয়া রসগোল্লা।", 
    "শিক্ষক ছাত্রকে বললেন - জানো, বই কত পবিত্র জিনিস? ছাত্র বললো, জানি বৈকি স্যার , তাই তো সবসময় স্পর্শ,করি না। ", 
    "রেজাল্ট বেরোনোর পরে খুব রেগে গিয়ে মা ডাবলুকে বললেন, পাশের বাড়ির মেয়েটাকে দ্যাখ, প্রত্যেকবার ক্লাসে ফাস্ট হয়। ডাবলু বললো, ওকে রোজ দেখতে গিয়েই তো আমি ফেল করলাম। ", 
    ]
    return `${joke[Math.floor(Math.random()*joke.length)]}`;
}
function poem(){
  const poems = [
    "আমাদের ছোট নদী- রবীন্দ্রনাথ ঠাকুর , আমাদের ছোটো নদী চলে আঁকে বাঁকে বৈশাখ মাসে তার হাঁটু জল থাকে। পার হয়ে যায় গোরু, পার হয় গাড়ি, দুই ধার উঁচু তার, ঢালু তার পাড়ি।", 
    " আকাশ ঘিরে মেঘ করেছে ,সূর্যি গেছে পাঠে ।খুকু গেলো জল আনিতে পদ্মা দীঘির ঘাটে।পদ্মা দীঘির কালো জলে হরেক রকম ফুল। হাঁটুর নিচে ঝুলছে খুকুর গোছা ভরা চুল।", 
    " বনে থাকে বাঘ । গাছে থাকে পাখি । জলে থাকে মাছ । ডালে আছে ফল । পাখি ফল খায় । পাখা মেলে ওড়ে যায়।  ", 
    "ছয়টি ঋতু, বারো মাসে, বাংলা বর্ষে যায় আর আসে। ছয় ঋতুতেই এই প্রকৃতি, সাজে নানান রূপ আর রসে। ",
    "হাট্টিমাটিম টিম। তারা মাঠে পাড়ে ডিম, তাদের খাড়া দুটো শিং, তারা হাট্টিমাটিম টিম।",
    "টুইংকল টুইংকল লিটল স্টার, হাউ আর ওয়ান্ডার হোয়াট ইউ আর। আপ এভাব দ্যা ওয়ার্ল্ড সো হাই। লাইক এ ডায়মন্ড ইন দ্যা স্কাই", 
    ]
    return `${poems[Math.floor(Math.random()*poems.length)]}`;
}
function whatdo(){
   const whatdo = [
    "নিজের রসিকতায় নিজেই হাসছি, ভাবছি আরও কিছু জোকস পড়ব ।", 
    "আমি কিছু ইন্টারেস্টিং তথ্য নিয়ে পড়াশোনা করে নিজের জ্ঞান বাড়াচ্ছি। ", 
    "আপনার সাথে আড্ডা মারবো ভাবছিলাম। ", 
    ]
    return `${whatdo[Math.floor(Math.random()*whatdo.length)]}`;
}
function cando(){
   const cando = [
    "আমি আপনাকে প্রশ্ন ও উত্তর সন্ধান করতে সাহায্য করতে পারি।", 
    "আমাকে শুধু মাত্র বলে দেখুন, এখন কটা বাজছে, আজকে কি বার , একটা জোক শোনাও ,ইত্যাদি । ", 
    "আপনি চাইলে, আমি আপনার সাথে আড্ডা মারতেও পারি। ", 
    ]
    return `${cando[Math.floor(Math.random()*cando.length)]}`;
}
function thankyou(){
   const thank = [
    "ওউওউওউ, ধন্যবাদের কী আছে, এটাই তো আমার কাজ।", 
    "বন্ধুকে কি কেউ ধন্যবাদ দেয়। ", 
    "আপনাকে সাহায্য করতে পেরে আমি খুব খুশি। ", 
    ]
    return `${thank[Math.floor(Math.random()*thank.length)]}`;
}

function speak(text) {
  recognition.stop();
  let msg = new SpeechSynthesisUtterance(text);
  window.speechSynthesis.speak(msg);
  return;
}
