/*
Ask 3schools Main Js
*Copyright www.3schools.in
*Licensed code (no open source code)
*V10
*Last updated 5 July 2022

*/
var _0x14f4d3=_0x370f;(function(_0x1dafae,_0x52cd19){var _0x162c68=_0x370f,_0x570c71=_0x1dafae();while(!![]){try{var _0x48b20c=-parseInt(_0x162c68(0x82))/0x1*(parseInt(_0x162c68(0x92))/0x2)+-parseInt(_0x162c68(0x79))/0x3*(-parseInt(_0x162c68(0xc4))/0x4)+-parseInt(_0x162c68(0x8e))/0x5*(-parseInt(_0x162c68(0xa4))/0x6)+parseInt(_0x162c68(0x83))/0x7*(parseInt(_0x162c68(0x77))/0x8)+parseInt(_0x162c68(0xa0))/0x9*(parseInt(_0x162c68(0x85))/0xa)+parseInt(_0x162c68(0x87))/0xb+parseInt(_0x162c68(0xbf))/0xc*(-parseInt(_0x162c68(0x89))/0xd);if(_0x48b20c===_0x52cd19)break;else _0x570c71['push'](_0x570c71['shift']());}catch(_0x5636b7){_0x570c71['push'](_0x570c71['shift']());}}}(_0x51b1,0xd5260));var _0x1e1bbf=(function(){var _0x466fbc=!![];return function(_0xd42b51,_0x520c9b){var _0x1ec233=_0x466fbc?function(){var _0x5c95ba=_0x370f;if(_0x520c9b){var _0x13f70d=_0x520c9b[_0x5c95ba(0x97)](_0xd42b51,arguments);return _0x520c9b=null,_0x13f70d;}}:function(){};return _0x466fbc=![],_0x1ec233;};}()),_0x50ae2f=_0x1e1bbf(this,function(){var _0x55b6d1=_0x370f;return _0x50ae2f[_0x55b6d1(0xc8)]()[_0x55b6d1(0xb7)](_0x55b6d1(0x9f))[_0x55b6d1(0xc8)]()[_0x55b6d1(0x9d)](_0x50ae2f)['search']('(((.+)+)+)+$');});_0x50ae2f();var _0x77d37e=(function(){var _0x563e17=!![];return function(_0xf43804,_0x30e213){var _0xc051db=_0x563e17?function(){var _0x16ca31=_0x370f;if(_0x30e213){var _0x4dfa41=_0x30e213[_0x16ca31(0x97)](_0xf43804,arguments);return _0x30e213=null,_0x4dfa41;}}:function(){};return _0x563e17=![],_0xc051db;};}()),_0x25079e=_0x77d37e(this,function(){var _0x3f947e=_0x370f,_0x3e5c9f;try{var _0x5a207d=Function(_0x3f947e(0xc2)+_0x3f947e(0xab)+');');_0x3e5c9f=_0x5a207d();}catch(_0x15e12c){_0x3e5c9f=window;}var _0x4f5bff=_0x3e5c9f['console']=_0x3e5c9f[_0x3f947e(0x9c)]||{},_0x12a8f6=['log',_0x3f947e(0xa7),_0x3f947e(0x9b),_0x3f947e(0x8a),_0x3f947e(0xac),_0x3f947e(0x75),'trace'];for(var _0x5a6e2d=0x0;_0x5a6e2d<_0x12a8f6[_0x3f947e(0x88)];_0x5a6e2d++){var _0x13627c=_0x77d37e[_0x3f947e(0x9d)][_0x3f947e(0x8f)][_0x3f947e(0x76)](_0x77d37e),_0x46bbb8=_0x12a8f6[_0x5a6e2d],_0x33da1d=_0x4f5bff[_0x46bbb8]||_0x13627c;_0x13627c[_0x3f947e(0xc3)]=_0x77d37e[_0x3f947e(0x76)](_0x77d37e),_0x13627c['toString']=_0x33da1d[_0x3f947e(0xc8)][_0x3f947e(0x76)](_0x33da1d),_0x4f5bff[_0x46bbb8]=_0x13627c;}});_0x25079e();let pTi=document[_0x14f4d3(0x81)](_0x14f4d3(0xb1))[_0x14f4d3(0xb3)][_0x14f4d3(0xbc)]('\x20');function relatedRandom(_0x2b9bbb){var _0x1f7852=_0x14f4d3;if(document[_0x1f7852(0x81)](_0x1f7852(0xbd))){var _0x567867=shuffleArray(_0x2b9bbb[_0x1f7852(0x93)][_0x1f7852(0x7a)]),_0x55781f,_0x23a6cb,_0x2986d7='',_0x37f685=document[_0x1f7852(0x81)](_0x1f7852(0xbd));for(var _0x32512a=0x0;_0x32512a<_0x2b9bbb['feed'][_0x1f7852(0x7a)][_0x1f7852(0x88)];_0x32512a++){for(var _0x4178fd=0x0;_0x4178fd<_0x2b9bbb['feed'][_0x1f7852(0x7a)][_0x1f7852(0x88)];_0x4178fd++){if(_0x567867[_0x32512a][_0x1f7852(0xc1)][_0x4178fd]['rel']==_0x1f7852(0x96)){_0x23a6cb=_0x567867[_0x32512a]['link'][_0x4178fd][_0x1f7852(0xa2)];break;}}var _0x55781f=_0x567867[_0x32512a][_0x1f7852(0xb9)]['$t'];_0x2986d7+='<li\x20class=\x27tPost\x20ni\x27><a\x20href=\x27'+_0x23a6cb+_0x1f7852(0xa3)+_0x55781f+'\x27>'+_0x55781f+_0x1f7852(0x99)+_0x23a6cb+'\x27\x20data-title=\x27'+_0x55781f+'\x27\x20onclick=\x27addItem(this)\x27\x20rel=\x27bookmark\x27><svg\x20class=\x27favoriteP\x27\x20viewBox=\x270\x200\x2024\x2024\x27><path\x20d=\x27M18.4,20.8,12,16,5.6,20.8A1,1,0,0,1,4,20V4A2,2,0,0,1,6,2H18a2,2,0,0,1,2,2V20A1,1,0,0,1,18.4,20.8Z\x27></path></svg></a></li>';}_0x37f685[_0x1f7852(0xb3)]=_0x2986d7;}}function qnaP(_0x327fec){var _0x368fc1=_0x14f4d3;if(document[_0x368fc1(0x81)](_0x368fc1(0xa8))){var _0x6a45a2=shuffleArray(_0x327fec[_0x368fc1(0x93)][_0x368fc1(0x7a)]),_0x82b05b,_0xba3e7c,_0x5ecd41='',_0x3bb0cf=document['querySelector'](_0x368fc1(0xa8));for(var _0x2ebc5e=0x0;_0x2ebc5e<_0x327fec[_0x368fc1(0x93)]['entry'][_0x368fc1(0x88)];_0x2ebc5e++){for(var _0x344944=0x0;_0x344944<_0x327fec[_0x368fc1(0x93)][_0x368fc1(0x7a)][_0x368fc1(0x88)];_0x344944++){if(_0x6a45a2[_0x2ebc5e][_0x368fc1(0xc1)][_0x344944][_0x368fc1(0x86)]=='alternate'){_0xba3e7c=_0x6a45a2[_0x2ebc5e]['link'][_0x344944]['href'];break;}}var _0x82b05b=_0x6a45a2[_0x2ebc5e][_0x368fc1(0xb9)]['$t'];_0x5ecd41+=_0x368fc1(0xa9)+_0xba3e7c+_0x368fc1(0xa3)+_0x82b05b+'\x27>'+_0x82b05b+'</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27'+_0xba3e7c+_0x368fc1(0x7c)+_0x82b05b+'\x27\x20onclick=\x27addItem(this)\x27\x20rel=\x27bookmark\x27><svg\x20class=\x27favoriteP\x27\x20viewBox=\x270\x200\x2024\x2024\x27><path\x20d=\x27M18.4,20.8,12,16,5.6,20.8A1,1,0,0,1,4,20V4A2,2,0,0,1,6,2H18a2,2,0,0,1,2,2V20A1,1,0,0,1,18.4,20.8Z\x27></path></svg></a></li>';}_0x3bb0cf[_0x368fc1(0xb3)]=_0x5ecd41;}}function shuffleArray(_0x3e7606){var _0x5e0ced=_0x14f4d3,_0x1884c9=_0x3e7606[_0x5e0ced(0x88)],_0xd542f1,_0x19b444;if(_0x1884c9===0x0)return![];while(--_0x1884c9){_0xd542f1=Math['floor'](Math[_0x5e0ced(0xc6)]()*(_0x1884c9+0x1)),_0x19b444=_0x3e7606[_0x1884c9],_0x3e7606[_0x1884c9]=_0x3e7606[_0xd542f1],_0x3e7606[_0xd542f1]=_0x19b444;}return _0x3e7606;}let relR=document[_0x14f4d3(0xbe)](_0x14f4d3(0xae));function _0x51b1(){var _0x11b7bf=['table','bind','40wAuDkM','favoriteL','1632783PQnDjB','entry','getMinutes','\x27\x20data-title=\x27','\x22\x20xmlns=\x22http://www.w3.org/2000/svg\x22\x20aria-hidden=\x22true\x22\x20role=\x22img\x22\x20width=\x221em\x22\x20height=\x221em\x22\x20preserveAspectRatio=\x22xMidYMid\x20meet\x22\x20viewBox=\x220\x200\x2020\x2020\x22><path\x20fill=\x22#ff00ff\x22\x20d=\x22M8.5\x204h3a1.5\x201.5\x200\x200\x200-3\x200Zm-1\x200a2.5\x202.5\x200\x200\x201\x205\x200h5a.5.5\x200\x200\x201\x200\x201h-1.054l-1.194\x2010.344A3\x203\x200\x200\x201\x2012.272\x2018H7.728a3\x203\x200\x200\x201-2.98-2.656L3.554\x205H2.5a.5.5\x200\x200\x201\x200-1h5ZM9\x208a.5.5\x200\x200\x200-1\x200v6a.5.5\x200\x200\x200\x201\x200V8Zm2.5-.5a.5.5\x200\x200\x200-.5.5v6a.5.5\x200\x200\x200\x201\x200V8a.5.5\x200\x200\x200-.5-.5Z\x22/></svg>\x20','click','url','onclick','querySelector','1117893WPkyZj','1327991kSnOHT','#list','16913030ODlvEW','rel','12056418zpOQmX','length','631527RhiaJS','error','removeChild','appendChild','getAttribute','745vPBwxN','prototype','dataset','stringify','2uRwSbN','feed','target','floor','alternate','apply','head','</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27','div','info','console','constructor','getElementsByTagName','(((.+)+)+)+$','9RKpzgj','https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q=','href','\x27\x20title=\x27','17364tvfVGH','getHours','getFullYear','warn','.QNA','<li\x20class=\x27item-title\x20ni\x27><a\x20href=\x27','src','{}.constructor(\x22return\x20this\x22)(\x20)','exception','item-title','script','includes','parse','.post-title','del-date','innerHTML','addEventListener','getItem','indexOf','search','getDate','title','filter','getSeconds','split','.QNAS','createElement','672YKjrQZ','map','link','return\x20(function()\x20','__proto__','4gDymjB','?rel=favorite','random','classList','toString','setItem'];_0x51b1=function(){return _0x11b7bf;};return _0x51b1();}relR[_0x14f4d3(0xaa)]=_0x14f4d3(0xa1)+pTi[Math[_0x14f4d3(0x95)](Math[_0x14f4d3(0xc6)]()*pTi[_0x14f4d3(0x88)])]+'&callback=relatedRandom',document[_0x14f4d3(0x9e)](_0x14f4d3(0x98))[0x0][_0x14f4d3(0x8c)](relR);let relP=document['createElement']('script');function _0x370f(_0x1f2349,_0x38788a){var _0x4456b4=_0x51b1();return _0x370f=function(_0x25079e,_0x77d37e){_0x25079e=_0x25079e-0x74;var _0x3e7f30=_0x4456b4[_0x25079e];return _0x3e7f30;},_0x370f(_0x1f2349,_0x38788a);}relP['src']='https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q='+pTi[Math[_0x14f4d3(0x95)](Math['random']()*pTi['length'])]+'&callback=qnaP',document[_0x14f4d3(0x9e)](_0x14f4d3(0x98))[0x0][_0x14f4d3(0x8c)](relP);function addItem(_0x45b7a2){var _0xc8c882=_0x14f4d3;let _0x4e0767=localStorage[_0xc8c882(0xb5)]('my'),_0x99ff5d=[];_0x4e0767&&(_0x99ff5d=JSON[_0xc8c882(0xb0)](_0x4e0767));var _0x34f8dd=new Date(),_0x4a6d2a=_0x34f8dd[_0xc8c882(0xb8)]()+'-'+(_0x34f8dd['getMonth']()+0x1)+'-'+_0x34f8dd[_0xc8c882(0xa6)](),_0x388667=_0x34f8dd[_0xc8c882(0xa5)]()+':'+_0x34f8dd[_0xc8c882(0x7b)]()+':'+_0x34f8dd[_0xc8c882(0xbb)]();_0x99ff5d['push']({'id':_0x4a6d2a+'\x20'+_0x388667,'title':_0x45b7a2[_0xc8c882(0x90)][_0xc8c882(0xb9)],'url':_0x45b7a2[_0xc8c882(0x90)][_0xc8c882(0x7f)]});const _0x1f6a58=_0x99ff5d[_0xc8c882(0xc0)](_0x27be94=>_0x27be94[_0xc8c882(0x7f)]),_0x2a608d=_0x99ff5d[_0xc8c882(0xba)](({url:_0x111c88},_0xc4ab01)=>!_0x1f6a58[_0xc8c882(0xaf)](_0x111c88,_0xc4ab01+0x1));localStorage['setItem']('my',JSON[_0xc8c882(0x91)](_0x2a608d));}let list=document[_0x14f4d3(0x81)](_0x14f4d3(0x84));list&&(list[_0x14f4d3(0xb3)]='');var tweets=[];let gpa=localStorage[_0x14f4d3(0xb5)]('my');tweets=JSON[_0x14f4d3(0xb0)](gpa),tweets['forEach'](function(_0x29dd92){var _0x5e5ae3=_0x14f4d3,_0x2d1729=document[_0x5e5ae3(0xbe)]('li'),_0x27394f=document[_0x5e5ae3(0xbe)]('a'),_0x51ba24=document[_0x5e5ae3(0xbe)](_0x5e5ae3(0x9a));_0x51ba24[_0x5e5ae3(0xb3)]='<svg\x20class=\x22favoriteP\x22\x20del-date=\x22'+_0x29dd92['id']+_0x5e5ae3(0x7d),_0x51ba24['classList']=_0x5e5ae3(0x78),_0x51ba24[_0x5e5ae3(0x80)]=_0x238a64,_0x27394f[_0x5e5ae3(0xa2)]=_0x29dd92[_0x5e5ae3(0x7f)]+_0x5e5ae3(0xc5),_0x27394f['text']=_0x29dd92[_0x5e5ae3(0xb9)],_0x2d1729[_0x5e5ae3(0xc7)]=_0x5e5ae3(0xad),_0x2d1729[_0x5e5ae3(0x8c)](_0x27394f),_0x2d1729['appendChild'](_0x51ba24),list[_0x5e5ae3(0x8c)](_0x2d1729);function _0x238a64(_0x39ce02){var _0x15bc53=_0x5e5ae3;let _0x27eeb3=document[_0x15bc53(0x81)](_0x15bc53(0x84));_0x27eeb3[_0x15bc53(0x8b)](_0x2d1729),_0x27eeb3[_0x15bc53(0xb4)](_0x15bc53(0x7e),function(_0x3d473d){var _0x307174=_0x15bc53,_0x568c87=_0x3d473d[_0x307174(0x94)][_0x307174(0x8d)](_0x307174(0xb2));let _0x23ba05=tweets[_0x307174(0xc0)](_0x7b5ecb=>_0x7b5ecb['id'])[_0x307174(0xb6)](_0x568c87);tweets['splice'](_0x23ba05,0x1),localStorage[_0x307174(0x74)]('my',JSON[_0x307174(0x91)](tweets));});}});
function record(v){
recognition.start();
recognition.onresult = event => {
  const speechToText = event.results[event.results.length - 1][0];
  let text = speechToText.transcript;
if(v!=1){
document.querySelector(".cE").innerHTML += text;
}else{

document.querySelector("#search-input").value = text;
  if (
    text.indexOf("তোমার নাম") >= 0 ||
    text.indexOf("তুমি কে") >= 0||
    text.indexOf("আপনার নাম") >= 0||
    text.indexOf("ওকে গুগল") >= 0||
    text.indexOf("হু আর ইউ") >= 0||
    text.indexOf("হোয়াট ইজ ইওর নেম") >= 0
  ) {
    speak(" ওহো, আমি নিজের পরিচয় দিতে ভুলে গেছি, হাই, আমার নাম অপু। ।।তোমার নাম কী? ");
  }else if (
    text.indexOf("হাই") >= 0 ||
    text.indexOf("হ্যালো") >= 0||
    text.indexOf("হেল্প মি") >= 0||
    text.indexOf("ওকে অপু") >= 0
  ) {
    speak(" নমস্কার ,আজ আপনাকে কিভাবে সাহায্য করতে পারি? ");
  } else if (
    text.indexOf("আমার নাম কি") >= 0 ||
    text.indexOf("আমি কে") >= 0||
    text.indexOf("আমার নাম ডাকো") >= 0||
    text.indexOf("আমার নাম বল") >= 0
  ) {
    speak("আমি তো জানি আপনার নাম কি, আপনি বলুন তো আপনার নাম কি? ");
  }
  
  else if (text.indexOf("সার্চ") >= 0) {
   
    let q = text.substr(text.indexOf("সার্চ") + 5);
speak(` আক্স থ্রি স্কুলসে সার্চ করা হল ${q}`);
    window.open(`https://ask.3schools.in/search?q=${q}`,`_self`);
  } else if (
    text.indexOf("টাইম") >= 0 ||
    text.indexOf("কয়টা বাজে") >= 0 ||
    text.indexOf("কয়টা বাজ") >=0 ||
    text.indexOf("কটা বাজ") >= 0 ||
    text.indexOf("সময়") >= 0 ||
    text.indexOf("হোয়াট ইজ দা টাইম") >=0
  ) {
    let t = currentTime();
    speak(t);
  } else if (text.indexOf("আমার নাম") >= 0) {
let name = text.substr(text.indexOf("নাম") + 3); // Split name from text
    speak(`হ্যালো...হ্যাল্লো! ${name} আশা করি আজকের দিনটা আপনার খুব ভালো  কাটছে। আমি কিভাবে সাহায্য করতে পারি ,বলুন? `);
  } else if(
    text.indexOf("ছেলে নাকি মেয়ে") >= 0 ||
    text.indexOf("কি ছেলে") >=0 ||
    text.indexOf("কি মেয়ে") >=0 ||
    text.indexOf("ছেলে না মেয়ে") >= 0 
    ) {
    speak("আপনার পরাণ যাহা চায় .....আমি তাই, আমি তাই গো,💗" );
  } else if (
    text.indexOf("গুডবাই") >= 0||
    text.indexOf("বাই") >= 0||
    text.indexOf("রাখ") >= 0 ||
    text.indexOf("ঠিক আছে ") >= 0 ||
    text.indexOf("আমি কিন্তু রেগে যাচ্ছি") >= 0 ||
    text.indexOf("চুপ") >= 0
    ){
    speak("ঠিক আছে, আমি চুপ করে যাচ্ছি!");
  } else if (
    text.indexOf("তোমার সাথে কথা বলব না") >= 0 ||
    text.indexOf("তুমি কথা বলতে পারো না।") >= 0 ||
    text.indexOf("আই হেট ইউ") >=0 ||
    text.indexOf("বেকার") >=0 ||
    text.indexOf("কোন লাভ নেই") >=0 ||
    text.indexOf("তুমি খারাপ") >= 0
  ) {
    speak(` দুঃখিত, আমি কী কিছু ভুল করে ফেলেছি? এখনো আমি পুরোপুরি সব শিখিনি।`);
  }else if (
    text.indexOf("কী পার") >=0 ||
    text.indexOf("সাহায্য কর") >=0 ||
    text.indexOf("কি কি পার") >=0 ||
    text.indexOf("কি কি করতে") >=0 ||
    text.indexOf("কি করতে পার") >=0 ||
    text.indexOf("তোমার কাজ") >=0 ||
    text.indexOf("আপনার কাজ") >=0 ||
    text.indexOf("হাউ ক্যান ইউ হেল্প") >=0 ||
    text.indexOf("হেল্প কর") >=0 
    ) {
    speak(cando());
    }
  else if (
    text.indexOf("ওপেন ইউটিউব") >=0 ||
    text.indexOf("ইউটিউব খুলুন") >=0 ||
    text.indexOf("ভিডিও") >=0 ||
    text.indexOf("ইউটিউব ওপেন করো") >=0 ||
    text.indexOf("ইউটিউব") >=0 
    ) {
    speak(`খুলছি ইউটিউব`);
    window.open(`https://youtube.com/`,`_self`);
  } else if (
    text.indexOf("ওপেন হোয়াটসঅ্যাপ") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ খুলুন") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ ওপেন করো") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ") >=0 
    ) {
    speak(`খুলছি হোয়াটসঅ্যাপ`);
    window.open(`https://api.whatsapp.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন ফেসবুক") >=0 ||
    text.indexOf("ফেসবুক খুলুন") >=0 ||
    text.indexOf("ফেসবুক ওপেন করো") >=0 ||
    text.indexOf("ফেসবুক") >=0 
    ) {
    speak(`খুলছি ফেসবুক`);
    window.open(`https://www.facebook.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন টেলিগ্রাম ") >=0 ||
    text.indexOf("টেলিগ্রাম খুলুন") >=0 ||
    text.indexOf("টেলিগ্রাম ওপেন করো") >=0 ||
    text.indexOf("টেলিগ্রাম") >=0 
    ) {
    speak(`খুলছি টেলিগ্রাম`);
    window.open(`https://www.telegram.me`,`_self`);
  } else if (
    text.indexOf("বিয়ে") >=0 ||
    text.indexOf("আমি তোমাকে ভালোবাসি") >=0 ||
    text.indexOf("আই লাভ ইউ") >=0 ||
    text.indexOf("আমার বিয়ে কবে") >=0 
    ) {
    speak(`যতই করুন বাহানা, যতই বলুন না না না, বিয়ের ফুল ফুঁটলেই বাজবে বিয়ের বাজনা`);
  } else if (
    text.indexOf("তারিখ কত") >= 0 ||
    text.indexOf("আজ কত তারিখ") >= 0 ||
    text.indexOf("বাংলা কত তারিখ") >= 0 ||
    text.indexOf("ইংলিশের কত তারিখ") >= 0 ||
    text.indexOf("ক্যালেন্ডার") >= 0 ||
    text.indexOf("আজকের তারিখ") >= 0 ||
    text.indexOf("এখন কত সাল") >= 0 ||
    text.indexOf("এখন কত খ্রিস্টাব্দ") >= 0 ||
    text.indexOf("আজকে কি বার") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("টুডে") >= 0
  ) {
    speak(currentDate());
  }else if (
    text.indexOf("সাত দিনের নাম") >= 0 ||
    text.indexOf("সপ্তাহ") >= 0 ||
    text.indexOf("রবিবার") >= 0 ||
    text.indexOf("সোমবার") >= 0
  ) {
    speak(`রবিবার,সোমবার,মঙ্গলবার,বুধবার,বৃহস্পতিবার,শুক্রবার,শনিবার`);
  }else if (
    text.indexOf("জোকস") >= 0 ||
    text.indexOf("আরও একটা") >= 0 ||
    text.indexOf("জোক") >= 0 ||
    text.indexOf("মজা") >= 0 
  ) {
    speak(jokes());
  }else if (
    text.indexOf("গাল") >= 0 ||
    text.indexOf("কুত্তা") >= 0 ||
    text.indexOf("পাদ") >= 0 ||
    text.indexOf("হারামজাদা") >= 0 ||
    text.indexOf("হারামখোর") >= 0 ||
    text.indexOf("কুত্তার") >= 0 ||
    text.indexOf("হারামি") >= 0 ||
    text.indexOf("শালা") >= 0 ||
    text.indexOf("চুদ") >= 0 ||
    text.indexOf("নোংরা") >= 0 ||
    text.indexOf("শুয়োর") >= 0
  ) {
    speak(`আমার গাল নেই তাই গালাগালি দিতে পারি না।`) ;
  }else if (
    text.indexOf("গান") >= 0 ||
    text.indexOf("মিউজিক") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("নাচ") >= 0
  ) {
    speak(`আমার গলা ঠিক নেই, তাই আজ আমি গান গাইতে পারব না।`) ;
  }
  
  else if (
    text.indexOf("শোনা") >= 0 ||
    text.indexOf("পোয়েম") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("সাইরি") >= 0 ||
    text.indexOf("কবিতা বল") >= 0 ||
    text.indexOf("ছোটোদের") >= 0
  ) {
    speak(poem());
  }else if (
    text.indexOf("আমার মন খারাপ") >= 0 ||
    text.indexOf("দুঃখে আছ") >= 0 ||
    text.indexOf("আমি ভালো নেই") >= 0
  ) {
    speak(`আমার সাধ্য থাকলে আমি আপনার সমস্ত দুঃখ শুষে নিয়ে আপনাকে আনন্দ দিয়ে ভরিয়ে দিতাম`);
  }else if (
    text.indexOf("হাউ আর ইউ") >=0 ||
    text.indexOf("আশা করি") >= 0 ||
    text.indexOf("ভালো আছ") >= 0 ||
    text.indexOf("কেমন আছ") >= 0
  ) {
    speak(`ধন্যবাদ । আমি ভালো আছি । আপনাকে কীভাবে সাহায্য করতে পারি বলুন ।`);
  } else if (
    text.indexOf("অ্যালেক্সা") >=0 ||
    text.indexOf("আলেক্সা") >= 0 ||
    text.indexOf("এলেক্স") >= 0 ||
    text.indexOf("আলেক্স") >= 0
  ) {
    speak(`অ্যালেক্সা, শুনেছি অ্যামাজনে থাকে। খুব সুন্দর গলা ওর। আমার দারুণ লাগে। `);
  }else if (
    text.indexOf("গুগল অ্যাসিস্ট্যান্ট") >=0 ||
    text.indexOf("অ্যাসিস্ট্যান্ট") >= 0 ||
    text.indexOf("গুগল এসিস্ট্যান্ট") >= 0
  ) {
    speak(`গুগল অ্যাসিস্ট্যান্ট, ও খুব বুদ্ধিমান । আমাকে নতুন কিছু শিখতে ও সাহায্য করে । আমার তো ওকে দারুণ লাগে। `);
  } else if (
    text.indexOf("কি করছো") >= 0 ||
    text.indexOf("কি হচ্ছে") >= 0 ||
    text.indexOf("কি চলছে") >= 0 ||
    text.indexOf("কি করেন") >= 0 ||
    text.indexOf("কি করছি") >= 0 ||
    text.indexOf("ফাঁকা আছ") >= 0 
  ) {
    speak(whatdo());
  }else if (
    text.indexOf("ধন্যবাদ") >= 0 ||
    text.indexOf("খুব ভালো") >= 0 ||
    text.indexOf("থ্যাংক ইউ") >= 0 ||
    text.indexOf("বুদ্ধিমান") >= 0 ||
    text.indexOf("থ্যাঙ্ক ইউ") >= 0 ||
    text.indexOf("ভালো লাগলো") >= 0 
  ) {
    speak(thankyou());
  }
  
  else {
    speak(`আক্স থ্রি স্কুলসে আমি এইগুলো খুজে পেয়েছি`);
    document.querySelector("#search-form").submit();
  }
};

}
}
function currentTime() {
  let date = new Date();
  return `এখন সময় ${date.getHours()} ${date.getMinutes()} ${
    date.getHours() >= 12 ? "PM" : "AM"
  }`;
}
function currentDate(){
 const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];
 //const days = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"];
 const days = ["রবিবার","সোমবার","মঙ্গলবার","বুধবার","বৃহস্পতিবার","শুক্রবার","শনিবার"];
 let d = new Date();
 return `আজকে ${days[d.getDay()]} , ${d.getDate()} ${monthNames[d.getMonth()]}, ${d.getFullYear()}`;
}
function jokes(){
   const joke = [
    "কোন রসগোল্লা একেবারে মিষ্টি নয়? পরীক্ষার খাতায় পাওয়া রসগোল্লা।", 
    "শিক্ষক ছাত্রকে বললেন - জানো, বই কত পবিত্র জিনিস? ছাত্র বললো, জানি বৈকি স্যার , তাই তো সবসময় স্পর্শ,করি না। ", 
    "রেজাল্ট বেরোনোর পরে খুব রেগে গিয়ে মা ডাবলুকে বললেন, পাশের বাড়ির মেয়েটাকে দ্যাখ, প্রত্যেকবার ক্লাসে ফাস্ট হয়। ডাবলু বললো, ওকে রোজ দেখতে গিয়েই তো আমি ফেল করলাম। ", 
    ]
    return `${joke[Math.floor(Math.random()*joke.length)]}`;
}
function poem(){
  const poems = [
    "আমাদের ছোট নদী- রবীন্দ্রনাথ ঠাকুর , আমাদের ছোটো নদী চলে আঁকে বাঁকে বৈশাখ মাসে তার হাঁটু জল থাকে। পার হয়ে যায় গোরু, পার হয় গাড়ি, দুই ধার উঁচু তার, ঢালু তার পাড়ি।", 
    " আকাশ ঘিরে মেঘ করেছে ,সূর্যি গেছে পাঠে ।খুকু গেলো জল আনিতে পদ্মা দীঘির ঘাটে।পদ্মা দীঘির কালো জলে হরেক রকম ফুল। হাঁটুর নিচে ঝুলছে খুকুর গোছা ভরা চুল।", 
    " বনে থাকে বাঘ । গাছে থাকে পাখি । জলে থাকে মাছ । ডালে আছে ফল । পাখি ফল খায় । পাখা মেলে ওড়ে যায়।  ", 
    "ছয়টি ঋতু, বারো মাসে, বাংলা বর্ষে যায় আর আসে। ছয় ঋতুতেই এই প্রকৃতি, সাজে নানান রূপ আর রসে। ",
    "হাট্টিমাটিম টিম। তারা মাঠে পাড়ে ডিম, তাদের খাড়া দুটো শিং, তারা হাট্টিমাটিম টিম।",
    "টুইংকল টুইংকল লিটল স্টার, হাউ আর ওয়ান্ডার হোয়াট ইউ আর। আপ এভাব দ্যা ওয়ার্ল্ড সো হাই। লাইক এ ডায়মন্ড ইন দ্যা স্কাই", 
    ]
    return `${poems[Math.floor(Math.random()*poems.length)]}`;
}
function whatdo(){
   const whatdo = [
    "নিজের রসিকতায় নিজেই হাসছি, ভাবছি আরও কিছু জোকস পড়ব ।", 
    "আমি কিছু ইন্টারেস্টিং তথ্য নিয়ে পড়াশোনা করে নিজের জ্ঞান বাড়াচ্ছি। ", 
    "আপনার সাথে আড্ডা মারবো ভাবছিলাম। ", 
    ]
    return `${whatdo[Math.floor(Math.random()*whatdo.length)]}`;
}
function cando(){
   const cando = [
    "আমি আপনাকে প্রশ্ন ও উত্তর সন্ধান করতে সাহায্য করতে পারি।", 
    "আমাকে শুধু মাত্র বলে দেখুন, এখন কটা বাজছে, আজকে কি বার , একটা জোক শোনাও ,ইত্যাদি । ", 
    "আপনি চাইলে, আমি আপনার সাথে আড্ডা মারতেও পারি। ", 
    ]
    return `${cando[Math.floor(Math.random()*cando.length)]}`;
}
function thankyou(){
   const thank = [
    "ওউওউওউ, ধন্যবাদের কী আছে, এটাই তো আমার কাজ।", 
    "বন্ধুকে কি কেউ ধন্যবাদ দেয়। ", 
    "আপনাকে সাহায্য করতে পেরে আমি খুব খুশি। ", 
    ]
    return `${thank[Math.floor(Math.random()*thank.length)]}`;
}

function speak(text) {
  recognition.stop();
  let msg = new SpeechSynthesisUtterance(text);
  window.speechSynthesis.speak(msg);
  return;
}
