/*
Ask 3schools Main Js
*Copyright www.3schools.in
*Licensed code (no open source code)
*V10
*Last updated 5 July 2022

*/
var _0x2ed402=_0x4220;(function(_0x1d6239,_0x5ed598){var _0x293bdf=_0x4220,_0x251765=_0x1d6239();while(!![]){try{var _0x2d3c4d=-parseInt(_0x293bdf(0x1c8))/0x1+parseInt(_0x293bdf(0x1ac))/0x2*(-parseInt(_0x293bdf(0x1c5))/0x3)+parseInt(_0x293bdf(0x1b7))/0x4+parseInt(_0x293bdf(0x1b0))/0x5*(-parseInt(_0x293bdf(0x19f))/0x6)+parseInt(_0x293bdf(0x1c2))/0x7+parseInt(_0x293bdf(0x1c9))/0x8+parseInt(_0x293bdf(0x1c4))/0x9;if(_0x2d3c4d===_0x5ed598)break;else _0x251765['push'](_0x251765['shift']());}catch(_0x2ae929){_0x251765['push'](_0x251765['shift']());}}}(_0x1534,0xd2764));let pTi=document['querySelector'](_0x2ed402(0x193))['innerHTML'][_0x2ed402(0x195)]('\x20');function relatedRandom(_0x5cd265){var _0xc00b2a=_0x2ed402;if(document[_0xc00b2a(0x1ad)](_0xc00b2a(0x17f))){var _0x35a63d=shuffleArray(_0x5cd265[_0xc00b2a(0x1a2)][_0xc00b2a(0x1cc)]),_0x182300,_0x318d3e,_0x3cb132='',_0x4b69b8=document[_0xc00b2a(0x1ad)]('.QNAS');for(var _0x359249=0x0;_0x359249<_0x5cd265['feed'][_0xc00b2a(0x1cc)][_0xc00b2a(0x1a1)];_0x359249++){for(var _0x5f013f=0x0;_0x5f013f<_0x5cd265['feed'][_0xc00b2a(0x1cc)][_0xc00b2a(0x1a1)];_0x5f013f++){if(_0x35a63d[_0x359249]['link'][_0x5f013f][_0xc00b2a(0x1a5)]==_0xc00b2a(0x1b9)){_0x318d3e=_0x35a63d[_0x359249]['link'][_0x5f013f][_0xc00b2a(0x198)];break;}}var _0x182300=_0x35a63d[_0x359249][_0xc00b2a(0x1bd)]['$t'];_0x3cb132+=_0xc00b2a(0x1ae)+_0x318d3e+_0xc00b2a(0x19a)+_0x182300+'\x27>'+_0x182300+_0xc00b2a(0x1ba)+_0x318d3e+_0xc00b2a(0x1b8)+_0x182300+_0xc00b2a(0x184);}_0x4b69b8['innerHTML']=_0x3cb132;}}function _0x4220(_0x580860,_0x53d39a){var _0x4d0d86=_0x1534();return _0x4220=function(_0x41cb0e,_0x308850){_0x41cb0e=_0x41cb0e-0x17f;var _0x26d55b=_0x4d0d86[_0x41cb0e];return _0x26d55b;},_0x4220(_0x580860,_0x53d39a);}function qnaP(_0x18a837){var _0x39be50=_0x2ed402;if(document['querySelector'](_0x39be50(0x19c))){var _0x463383=shuffleArray(_0x18a837['feed'][_0x39be50(0x1cc)]),_0x4fa71d,_0x3a2f81,_0x2671f0='',_0x7d17d6=document['querySelector'](_0x39be50(0x19c));for(var _0x4fbd0a=0x0;_0x4fbd0a<_0x18a837[_0x39be50(0x1a2)][_0x39be50(0x1cc)][_0x39be50(0x1a1)];_0x4fbd0a++){for(var _0x15097f=0x0;_0x15097f<_0x18a837['feed'][_0x39be50(0x1cc)]['length'];_0x15097f++){if(_0x463383[_0x4fbd0a][_0x39be50(0x1c1)][_0x15097f][_0x39be50(0x1a5)]==_0x39be50(0x1b9)){_0x3a2f81=_0x463383[_0x4fbd0a]['link'][_0x15097f][_0x39be50(0x198)];break;}}var _0x4fa71d=_0x463383[_0x4fbd0a]['title']['$t'];_0x2671f0+=_0x39be50(0x1a4)+_0x3a2f81+_0x39be50(0x19a)+_0x4fa71d+'\x27>'+_0x4fa71d+_0x39be50(0x1ba)+_0x3a2f81+_0x39be50(0x1b8)+_0x4fa71d+_0x39be50(0x184);}_0x7d17d6[_0x39be50(0x189)]=_0x2671f0;}}function shuffleArray(_0x5f1a55){var _0x2f0426=_0x2ed402,_0x5a4af5=_0x5f1a55[_0x2f0426(0x1a1)],_0x4ebe97,_0x3f8881;if(_0x5a4af5===0x0)return![];while(--_0x5a4af5){_0x4ebe97=Math[_0x2f0426(0x196)](Math['random']()*(_0x5a4af5+0x1)),_0x3f8881=_0x5f1a55[_0x5a4af5],_0x5f1a55[_0x5a4af5]=_0x5f1a55[_0x4ebe97],_0x5f1a55[_0x4ebe97]=_0x3f8881;}return _0x5f1a55;}let relR=document[_0x2ed402(0x188)](_0x2ed402(0x194));relR[_0x2ed402(0x1b4)]=_0x2ed402(0x199)+pTi[Math[_0x2ed402(0x196)](Math[_0x2ed402(0x1a0)]()*pTi[_0x2ed402(0x1a1)])]+'&callback=relatedRandom',document[_0x2ed402(0x1bb)]('head')[0x0][_0x2ed402(0x1a9)](relR);let relP=document[_0x2ed402(0x188)](_0x2ed402(0x194));relP[_0x2ed402(0x1b4)]=_0x2ed402(0x199)+pTi[Math[_0x2ed402(0x196)](Math['random']()*pTi[_0x2ed402(0x1a1)])]+_0x2ed402(0x182),document[_0x2ed402(0x1bb)]('head')[0x0][_0x2ed402(0x1a9)](relP);function addItem(_0x1bc6dd){var _0x2dc326=_0x2ed402;let _0x2b859b=localStorage[_0x2dc326(0x19b)]('my'),_0x1b18b0=[];_0x2b859b&&(_0x1b18b0=JSON[_0x2dc326(0x191)](_0x2b859b));var _0x2b44ff=new Date(),_0x10bd4f=_0x2b44ff[_0x2dc326(0x1b3)]()+'-'+(_0x2b44ff['getMonth']()+0x1)+'-'+_0x2b44ff[_0x2dc326(0x1c7)](),_0x5e3a41=_0x2b44ff['getHours']()+':'+_0x2b44ff[_0x2dc326(0x1bc)]()+':'+_0x2b44ff[_0x2dc326(0x1a3)]();_0x1b18b0[_0x2dc326(0x18c)]({'id':_0x10bd4f+'\x20'+_0x5e3a41,'title':_0x1bc6dd['dataset']['title'],'url':_0x1bc6dd[_0x2dc326(0x19d)][_0x2dc326(0x18b)]});const _0x10bd5f=_0x1b18b0[_0x2dc326(0x1aa)](_0x492297=>_0x492297[_0x2dc326(0x18b)]),_0x42442c=_0x1b18b0['filter'](({url:_0x3aba07},_0x365b14)=>!_0x10bd5f[_0x2dc326(0x185)](_0x3aba07,_0x365b14+0x1));localStorage[_0x2dc326(0x1a7)]('my',JSON[_0x2dc326(0x18f)](_0x42442c)),addtof();}function addtof(){var _0x5fdea3=_0x2ed402,_0xc6cd1b=(function(){var _0x12d1bf=!![];return function(_0x4d674a,_0x93eeaa){var _0x23959e=_0x12d1bf?function(){var _0x400ef9=_0x4220;if(_0x93eeaa){var _0xb203da=_0x93eeaa[_0x400ef9(0x190)](_0x4d674a,arguments);return _0x93eeaa=null,_0xb203da;}}:function(){};return _0x12d1bf=![],_0x23959e;};}()),_0x3f7abf=_0xc6cd1b(this,function(){var _0x1e87a4=_0x4220;return _0x3f7abf[_0x1e87a4(0x197)]()['search'](_0x1e87a4(0x18d))['toString']()[_0x1e87a4(0x1a6)](_0x3f7abf)['search'](_0x1e87a4(0x18d));});_0x3f7abf();var _0x36d42e=(function(){var _0x367133=!![];return function(_0x579c9a,_0x1c3e43){var _0x2582e5=_0x367133?function(){var _0x4fe9e9=_0x4220;if(_0x1c3e43){var _0x241cb7=_0x1c3e43[_0x4fe9e9(0x190)](_0x579c9a,arguments);return _0x1c3e43=null,_0x241cb7;}}:function(){};return _0x367133=![],_0x2582e5;};}()),_0x1626f1=_0x36d42e(this,function(){var _0x15b3ff=_0x4220,_0x34eead;try{var _0x5bc660=Function(_0x15b3ff(0x1a8)+'{}.constructor(\x22return\x20this\x22)(\x20)'+');');_0x34eead=_0x5bc660();}catch(_0x2a5e02){_0x34eead=window;}var _0x547006=_0x34eead[_0x15b3ff(0x1b2)]=_0x34eead[_0x15b3ff(0x1b2)]||{},_0x405b75=[_0x15b3ff(0x181),_0x15b3ff(0x180),_0x15b3ff(0x1ca),_0x15b3ff(0x1af),_0x15b3ff(0x1c0),_0x15b3ff(0x1b5),_0x15b3ff(0x18e)];for(var _0x1c3841=0x0;_0x1c3841<_0x405b75[_0x15b3ff(0x1a1)];_0x1c3841++){var _0x403a42=_0x36d42e[_0x15b3ff(0x1a6)][_0x15b3ff(0x19e)][_0x15b3ff(0x187)](_0x36d42e),_0x40c681=_0x405b75[_0x1c3841],_0x422e44=_0x547006[_0x40c681]||_0x403a42;_0x403a42[_0x15b3ff(0x186)]=_0x36d42e[_0x15b3ff(0x187)](_0x36d42e),_0x403a42['toString']=_0x422e44[_0x15b3ff(0x197)][_0x15b3ff(0x187)](_0x422e44),_0x547006[_0x40c681]=_0x403a42;}});_0x1626f1();let _0x7e0a98=document[_0x5fdea3(0x1ad)]('#list');_0x7e0a98&&(_0x7e0a98[_0x5fdea3(0x189)]='');var _0x196b04=[];let _0x187345=localStorage[_0x5fdea3(0x19b)]('my');_0x196b04=JSON[_0x5fdea3(0x191)](_0x187345),_0x196b04[_0x5fdea3(0x18a)](function(_0x485921){var _0x1b5182=_0x5fdea3,_0x57658b=document[_0x1b5182(0x188)]('li'),_0x2d7a11=document[_0x1b5182(0x188)]('a'),_0x9ae57d=document['createElement'](_0x1b5182(0x1b1));_0x9ae57d[_0x1b5182(0x189)]=_0x1b5182(0x1be)+_0x485921['id']+_0x1b5182(0x183),_0x9ae57d[_0x1b5182(0x1bf)]=_0x1b5182(0x1c6),_0x9ae57d['onclick']=_0x4b3524,_0x2d7a11[_0x1b5182(0x198)]=_0x485921[_0x1b5182(0x18b)]+_0x1b5182(0x1cd),_0x2d7a11['text']=_0x485921[_0x1b5182(0x1bd)],_0x57658b[_0x1b5182(0x1bf)]='item-title',_0x57658b[_0x1b5182(0x1a9)](_0x2d7a11),_0x57658b['appendChild'](_0x9ae57d),_0x7e0a98[_0x1b5182(0x1a9)](_0x57658b);function _0x4b3524(_0x2adbaf){var _0x2de26c=_0x1b5182;let _0xc88b88=document[_0x2de26c(0x1ad)]('#list');_0xc88b88[_0x2de26c(0x1ab)](_0x57658b),_0xc88b88[_0x2de26c(0x1b6)](_0x2de26c(0x192),function(_0x21ef16){var _0x275f61=_0x2de26c,_0x6410ea=_0x21ef16[_0x275f61(0x1cb)][_0x275f61(0x1c3)]('del-date');let _0x40c3ab=_0x196b04[_0x275f61(0x1aa)](_0x447dcf=>_0x447dcf['id'])['indexOf'](_0x6410ea);_0x196b04['splice'](_0x40c3ab,0x1),localStorage[_0x275f61(0x1a7)]('my',JSON[_0x275f61(0x18f)](_0x196b04));});}});}addtof();function _0x1534(){var _0x50a8e5=['console','getDate','src','table','addEventListener','4132544EiYSMM','\x27\x20data-title=\x27','alternate','</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27','getElementsByTagName','getMinutes','title','<svg\x20class=\x22favoriteP\x22\x20del-date=\x22','classList','exception','link','5175135AkgTqR','getAttribute','13703634NFEsta','9LyRCkZ','favoriteL','getFullYear','1554328WAUXfq','11717736EDtJCT','info','target','entry','?rel=favorite','.QNAS','warn','log','&callback=qnaP','\x22\x20xmlns=\x22http://www.w3.org/2000/svg\x22\x20aria-hidden=\x22true\x22\x20role=\x22img\x22\x20width=\x221em\x22\x20height=\x221em\x22\x20preserveAspectRatio=\x22xMidYMid\x20meet\x22\x20viewBox=\x220\x200\x2020\x2020\x22><path\x20fill=\x22#ff00ff\x22\x20d=\x22M8.5\x204h3a1.5\x201.5\x200\x200\x200-3\x200Zm-1\x200a2.5\x202.5\x200\x200\x201\x205\x200h5a.5.5\x200\x200\x201\x200\x201h-1.054l-1.194\x2010.344A3\x203\x200\x200\x201\x2012.272\x2018H7.728a3\x203\x200\x200\x201-2.98-2.656L3.554\x205H2.5a.5.5\x200\x200\x201\x200-1h5ZM9\x208a.5.5\x200\x200\x200-1\x200v6a.5.5\x200\x200\x200\x201\x200V8Zm2.5-.5a.5.5\x200\x200\x200-.5.5v6a.5.5\x200\x200\x200\x201\x200V8a.5.5\x200\x200\x200-.5-.5Z\x22/></svg>\x20','\x27\x20onclick=\x27addItem(this)\x27\x20rel=\x27bookmark\x27><svg\x20class=\x27favoriteP\x27\x20viewBox=\x270\x200\x2024\x2024\x27><path\x20d=\x27M18.4,20.8,12,16,5.6,20.8A1,1,0,0,1,4,20V4A2,2,0,0,1,6,2H18a2,2,0,0,1,2,2V20A1,1,0,0,1,18.4,20.8Z\x27></path></svg></a></li>','includes','__proto__','bind','createElement','innerHTML','forEach','url','push','(((.+)+)+)+$','trace','stringify','apply','parse','click','.post-title','script','split','floor','toString','href','https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q=','\x27\x20title=\x27','getItem','.QNA','dataset','prototype','6OpkrYm','random','length','feed','getSeconds','<li\x20class=\x27item-title\x20ni\x27><a\x20href=\x27','rel','constructor','setItem','return\x20(function()\x20','appendChild','map','removeChild','1028774hHMDiP','querySelector','<li\x20class=\x27tPost\x20ni\x27><a\x20href=\x27','error','4001215vyqeOP','div'];_0x1534=function(){return _0x50a8e5;};return _0x1534();}
function record(v){
recognition.start();
recognition.onresult = event => {
  const speechToText = event.results[event.results.length - 1][0];
  let text = speechToText.transcript;
if(v!=1){
document.querySelector(".cE").innerHTML += text;
}else{

document.querySelector("#search-input").value = text;
  if (
    text.indexOf("তোমার নাম") >= 0 ||
    text.indexOf("তুমি কে") >= 0||
    text.indexOf("আপনার নাম") >= 0||
    text.indexOf("ওকে গুগল") >= 0||
    text.indexOf("হু আর ইউ") >= 0||
    text.indexOf("হোয়াট ইজ ইওর নেম") >= 0
  ) {
    speak(" ওহো, আমি নিজের পরিচয় দিতে ভুলে গেছি, হাই, আমার নাম অপু। ।।তোমার নাম কী? ");
  }else if (
    text.indexOf("হাই") >= 0 ||
    text.indexOf("হ্যালো") >= 0||
    text.indexOf("হেল্প মি") >= 0||
    text.indexOf("ওকে অপু") >= 0
  ) {
    speak(" নমস্কার ,আজ আপনাকে কিভাবে সাহায্য করতে পারি? ");
  } else if (
    text.indexOf("আমার নাম কি") >= 0 ||
    text.indexOf("আমি কে") >= 0||
    text.indexOf("আমার নাম ডাকো") >= 0||
    text.indexOf("আমার নাম বল") >= 0
  ) {
    speak("আমি তো জানি আপনার নাম কি, আপনি বলুন তো আপনার নাম কি? ");
  }
  
  else if (text.indexOf("সার্চ") >= 0) {
   
    let q = text.substr(text.indexOf("সার্চ") + 5);
speak(` আক্স থ্রি স্কুলসে সার্চ করা হল ${q}`);
    window.open(`https://ask.3schools.in/search?q=${q}`,`_self`);
  } else if (
    text.indexOf("টাইম") >= 0 ||
    text.indexOf("কয়টা বাজে") >= 0 ||
    text.indexOf("কয়টা বাজ") >=0 ||
    text.indexOf("কটা বাজ") >= 0 ||
    text.indexOf("সময়") >= 0 ||
    text.indexOf("হোয়াট ইজ দা টাইম") >=0
  ) {
    let t = currentTime();
    speak(t);
  } else if (text.indexOf("আমার নাম") >= 0) {
let name = text.substr(text.indexOf("নাম") + 3); // Split name from text
    speak(`হ্যালো...হ্যাল্লো! ${name} আশা করি আজকের দিনটা আপনার খুব ভালো  কাটছে। আমি কিভাবে সাহায্য করতে পারি ,বলুন? `);
  } else if(
    text.indexOf("ছেলে নাকি মেয়ে") >= 0 ||
    text.indexOf("কি ছেলে") >=0 ||
    text.indexOf("কি মেয়ে") >=0 ||
    text.indexOf("ছেলে না মেয়ে") >= 0 
    ) {
    speak("আপনার পরাণ যাহা চায় .....আমি তাই, আমি তাই গো,💗" );
  } else if (
    text.indexOf("গুডবাই") >= 0||
    text.indexOf("বাই") >= 0||
    text.indexOf("রাখ") >= 0 ||
    text.indexOf("ঠিক আছে ") >= 0 ||
    text.indexOf("আমি কিন্তু রেগে যাচ্ছি") >= 0 ||
    text.indexOf("চুপ") >= 0
    ){
    speak("ঠিক আছে, আমি চুপ করে যাচ্ছি!");
  } else if (
    text.indexOf("তোমার সাথে কথা বলব না") >= 0 ||
    text.indexOf("তুমি কথা বলতে পারো না।") >= 0 ||
    text.indexOf("আই হেট ইউ") >=0 ||
    text.indexOf("বেকার") >=0 ||
    text.indexOf("কোন লাভ নেই") >=0 ||
    text.indexOf("তুমি খারাপ") >= 0
  ) {
    speak(` দুঃখিত, আমি কী কিছু ভুল করে ফেলেছি? এখনো আমি পুরোপুরি সব শিখিনি।`);
  }else if (
    text.indexOf("কী পার") >=0 ||
    text.indexOf("সাহায্য কর") >=0 ||
    text.indexOf("কি কি পার") >=0 ||
    text.indexOf("কি কি করতে") >=0 ||
    text.indexOf("কি করতে পার") >=0 ||
    text.indexOf("তোমার কাজ") >=0 ||
    text.indexOf("আপনার কাজ") >=0 ||
    text.indexOf("হাউ ক্যান ইউ হেল্প") >=0 ||
    text.indexOf("হেল্প কর") >=0 
    ) {
    speak(cando());
    }
  else if (
    text.indexOf("ওপেন ইউটিউব") >=0 ||
    text.indexOf("ইউটিউব খুলুন") >=0 ||
    text.indexOf("ভিডিও") >=0 ||
    text.indexOf("ইউটিউব ওপেন করো") >=0 ||
    text.indexOf("ইউটিউব") >=0 
    ) {
    speak(`খুলছি ইউটিউব`);
    window.open(`https://youtube.com/`,`_self`);
  } else if (
    text.indexOf("ওপেন হোয়াটসঅ্যাপ") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ খুলুন") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ ওপেন করো") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ") >=0 
    ) {
    speak(`খুলছি হোয়াটসঅ্যাপ`);
    window.open(`https://api.whatsapp.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন ফেসবুক") >=0 ||
    text.indexOf("ফেসবুক খুলুন") >=0 ||
    text.indexOf("ফেসবুক ওপেন করো") >=0 ||
    text.indexOf("ফেসবুক") >=0 
    ) {
    speak(`খুলছি ফেসবুক`);
    window.open(`https://www.facebook.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন টেলিগ্রাম ") >=0 ||
    text.indexOf("টেলিগ্রাম খুলুন") >=0 ||
    text.indexOf("টেলিগ্রাম ওপেন করো") >=0 ||
    text.indexOf("টেলিগ্রাম") >=0 
    ) {
    speak(`খুলছি টেলিগ্রাম`);
    window.open(`https://www.telegram.me`,`_self`);
  } else if (
    text.indexOf("বিয়ে") >=0 ||
    text.indexOf("আমি তোমাকে ভালোবাসি") >=0 ||
    text.indexOf("আই লাভ ইউ") >=0 ||
    text.indexOf("আমার বিয়ে কবে") >=0 
    ) {
    speak(`যতই করুন বাহানা, যতই বলুন না না না, বিয়ের ফুল ফুঁটলেই বাজবে বিয়ের বাজনা`);
  } else if (
    text.indexOf("তারিখ কত") >= 0 ||
    text.indexOf("আজ কত তারিখ") >= 0 ||
    text.indexOf("বাংলা কত তারিখ") >= 0 ||
    text.indexOf("ইংলিশের কত তারিখ") >= 0 ||
    text.indexOf("ক্যালেন্ডার") >= 0 ||
    text.indexOf("আজকের তারিখ") >= 0 ||
    text.indexOf("এখন কত সাল") >= 0 ||
    text.indexOf("এখন কত খ্রিস্টাব্দ") >= 0 ||
    text.indexOf("আজকে কি বার") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("টুডে") >= 0
  ) {
    speak(currentDate());
  }else if (
    text.indexOf("সাত দিনের নাম") >= 0 ||
    text.indexOf("সপ্তাহ") >= 0 ||
    text.indexOf("রবিবার") >= 0 ||
    text.indexOf("সোমবার") >= 0
  ) {
    speak(`রবিবার,সোমবার,মঙ্গলবার,বুধবার,বৃহস্পতিবার,শুক্রবার,শনিবার`);
  }else if (
    text.indexOf("জোকস") >= 0 ||
    text.indexOf("আরও একটা") >= 0 ||
    text.indexOf("জোক") >= 0 ||
    text.indexOf("মজা") >= 0 
  ) {
    speak(jokes());
  }else if (
    text.indexOf("গাল") >= 0 ||
    text.indexOf("কুত্তা") >= 0 ||
    text.indexOf("পাদ") >= 0 ||
    text.indexOf("হারামজাদা") >= 0 ||
    text.indexOf("হারামখোর") >= 0 ||
    text.indexOf("কুত্তার") >= 0 ||
    text.indexOf("হারামি") >= 0 ||
    text.indexOf("শালা") >= 0 ||
    text.indexOf("চুদ") >= 0 ||
    text.indexOf("নোংরা") >= 0 ||
    text.indexOf("শুয়োর") >= 0
  ) {
    speak(`আমার গাল নেই তাই গালাগালি দিতে পারি না।`) ;
  }else if (
    text.indexOf("গান") >= 0 ||
    text.indexOf("মিউজিক") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("নাচ") >= 0
  ) {
    speak(`আমার গলা ঠিক নেই, তাই আজ আমি গান গাইতে পারব না।`) ;
  }
  
  else if (
    text.indexOf("শোনা") >= 0 ||
    text.indexOf("পোয়েম") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("সাইরি") >= 0 ||
    text.indexOf("কবিতা বল") >= 0 ||
    text.indexOf("ছোটোদের") >= 0
  ) {
    speak(poem());
  }else if (
    text.indexOf("আমার মন খারাপ") >= 0 ||
    text.indexOf("দুঃখে আছ") >= 0 ||
    text.indexOf("আমি ভালো নেই") >= 0
  ) {
    speak(`আমার সাধ্য থাকলে আমি আপনার সমস্ত দুঃখ শুষে নিয়ে আপনাকে আনন্দ দিয়ে ভরিয়ে দিতাম`);
  }else if (
    text.indexOf("হাউ আর ইউ") >=0 ||
    text.indexOf("আশা করি") >= 0 ||
    text.indexOf("ভালো আছ") >= 0 ||
    text.indexOf("কেমন আছ") >= 0
  ) {
    speak(`ধন্যবাদ । আমি ভালো আছি । আপনাকে কীভাবে সাহায্য করতে পারি বলুন ।`);
  } else if (
    text.indexOf("অ্যালেক্সা") >=0 ||
    text.indexOf("আলেক্সা") >= 0 ||
    text.indexOf("এলেক্স") >= 0 ||
    text.indexOf("আলেক্স") >= 0
  ) {
    speak(`অ্যালেক্সা, শুনেছি অ্যামাজনে থাকে। খুব সুন্দর গলা ওর। আমার দারুণ লাগে। `);
  }else if (
    text.indexOf("গুগল অ্যাসিস্ট্যান্ট") >=0 ||
    text.indexOf("অ্যাসিস্ট্যান্ট") >= 0 ||
    text.indexOf("গুগল এসিস্ট্যান্ট") >= 0
  ) {
    speak(`গুগল অ্যাসিস্ট্যান্ট, ও খুব বুদ্ধিমান । আমাকে নতুন কিছু শিখতে ও সাহায্য করে । আমার তো ওকে দারুণ লাগে। `);
  } else if (
    text.indexOf("কি করছো") >= 0 ||
    text.indexOf("কি হচ্ছে") >= 0 ||
    text.indexOf("কি চলছে") >= 0 ||
    text.indexOf("কি করেন") >= 0 ||
    text.indexOf("কি করছি") >= 0 ||
    text.indexOf("ফাঁকা আছ") >= 0 
  ) {
    speak(whatdo());
  }else if (
    text.indexOf("ধন্যবাদ") >= 0 ||
    text.indexOf("খুব ভালো") >= 0 ||
    text.indexOf("থ্যাংক ইউ") >= 0 ||
    text.indexOf("বুদ্ধিমান") >= 0 ||
    text.indexOf("থ্যাঙ্ক ইউ") >= 0 ||
    text.indexOf("ভালো লাগলো") >= 0 
  ) {
    speak(thankyou());
  }
  
  else {
    speak(`আক্স থ্রি স্কুলসে আমি এইগুলো খুজে পেয়েছি`);
    document.querySelector("#search-form").submit();
  }
};

}
}
function currentTime() {
  let date = new Date();
  return `এখন সময় ${date.getHours()} ${date.getMinutes()} ${
    date.getHours() >= 12 ? "PM" : "AM"
  }`;
}
function currentDate(){
 const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];
 //const days = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"];
 const days = ["রবিবার","সোমবার","মঙ্গলবার","বুধবার","বৃহস্পতিবার","শুক্রবার","শনিবার"];
 let d = new Date();
 return `আজকে ${days[d.getDay()]} , ${d.getDate()} ${monthNames[d.getMonth()]}, ${d.getFullYear()}`;
}
function jokes(){
   const joke = [
    "কোন রসগোল্লা একেবারে মিষ্টি নয়? পরীক্ষার খাতায় পাওয়া রসগোল্লা।", 
    "শিক্ষক ছাত্রকে বললেন - জানো, বই কত পবিত্র জিনিস? ছাত্র বললো, জানি বৈকি স্যার , তাই তো সবসময় স্পর্শ,করি না। ", 
    "রেজাল্ট বেরোনোর পরে খুব রেগে গিয়ে মা ডাবলুকে বললেন, পাশের বাড়ির মেয়েটাকে দ্যাখ, প্রত্যেকবার ক্লাসে ফাস্ট হয়। ডাবলু বললো, ওকে রোজ দেখতে গিয়েই তো আমি ফেল করলাম। ", 
    ]
    return `${joke[Math.floor(Math.random()*joke.length)]}`;
}
function poem(){
  const poems = [
    "আমাদের ছোট নদী- রবীন্দ্রনাথ ঠাকুর , আমাদের ছোটো নদী চলে আঁকে বাঁকে বৈশাখ মাসে তার হাঁটু জল থাকে। পার হয়ে যায় গোরু, পার হয় গাড়ি, দুই ধার উঁচু তার, ঢালু তার পাড়ি।", 
    " আকাশ ঘিরে মেঘ করেছে ,সূর্যি গেছে পাঠে ।খুকু গেলো জল আনিতে পদ্মা দীঘির ঘাটে।পদ্মা দীঘির কালো জলে হরেক রকম ফুল। হাঁটুর নিচে ঝুলছে খুকুর গোছা ভরা চুল।", 
    " বনে থাকে বাঘ । গাছে থাকে পাখি । জলে থাকে মাছ । ডালে আছে ফল । পাখি ফল খায় । পাখা মেলে ওড়ে যায়।  ", 
    "ছয়টি ঋতু, বারো মাসে, বাংলা বর্ষে যায় আর আসে। ছয় ঋতুতেই এই প্রকৃতি, সাজে নানান রূপ আর রসে। ",
    "হাট্টিমাটিম টিম। তারা মাঠে পাড়ে ডিম, তাদের খাড়া দুটো শিং, তারা হাট্টিমাটিম টিম।",
    "টুইংকল টুইংকল লিটল স্টার, হাউ আর ওয়ান্ডার হোয়াট ইউ আর। আপ এভাব দ্যা ওয়ার্ল্ড সো হাই। লাইক এ ডায়মন্ড ইন দ্যা স্কাই", 
    ]
    return `${poems[Math.floor(Math.random()*poems.length)]}`;
}
function whatdo(){
   const whatdo = [
    "নিজের রসিকতায় নিজেই হাসছি, ভাবছি আরও কিছু জোকস পড়ব ।", 
    "আমি কিছু ইন্টারেস্টিং তথ্য নিয়ে পড়াশোনা করে নিজের জ্ঞান বাড়াচ্ছি। ", 
    "আপনার সাথে আড্ডা মারবো ভাবছিলাম। ", 
    ]
    return `${whatdo[Math.floor(Math.random()*whatdo.length)]}`;
}
function cando(){
   const cando = [
    "আমি আপনাকে প্রশ্ন ও উত্তর সন্ধান করতে সাহায্য করতে পারি।", 
    "আমাকে শুধু মাত্র বলে দেখুন, এখন কটা বাজছে, আজকে কি বার , একটা জোক শোনাও ,ইত্যাদি । ", 
    "আপনি চাইলে, আমি আপনার সাথে আড্ডা মারতেও পারি। ", 
    ]
    return `${cando[Math.floor(Math.random()*cando.length)]}`;
}
function thankyou(){
   const thank = [
    "ওউওউওউ, ধন্যবাদের কী আছে, এটাই তো আমার কাজ।", 
    "বন্ধুকে কি কেউ ধন্যবাদ দেয়। ", 
    "আপনাকে সাহায্য করতে পেরে আমি খুব খুশি। ", 
    ]
    return `${thank[Math.floor(Math.random()*thank.length)]}`;
}

function speak(text) {
  recognition.stop();
  let msg = new SpeechSynthesisUtterance(text);
  window.speechSynthesis.speak(msg);
  return;
}
