/*
Ask 3schools Main Js
*Copyright www.3schools.in
*Licensed code (no open source code)
*V8
*Last updated 5 June 2022

*/

var _0x3b5060=_0x2b01;function _0x2b01(_0x31869a,_0x395db4){var _0x1f4582=_0x1f45();return _0x2b01=function(_0x2b015e,_0x364757){_0x2b015e=_0x2b015e-0x172;var _0x2cc7b1=_0x1f4582[_0x2b015e];return _0x2cc7b1;},_0x2b01(_0x31869a,_0x395db4);}(function(_0x2b3fc3,_0x303457){var _0x59ab59=_0x2b01,_0x6aeb92=_0x2b3fc3();while(!![]){try{var _0x1ed9a4=-parseInt(_0x59ab59(0x18c))/0x1+-parseInt(_0x59ab59(0x19c))/0x2+-parseInt(_0x59ab59(0x1ad))/0x3*(-parseInt(_0x59ab59(0x191))/0x4)+parseInt(_0x59ab59(0x1af))/0x5+-parseInt(_0x59ab59(0x1a4))/0x6*(-parseInt(_0x59ab59(0x17b))/0x7)+parseInt(_0x59ab59(0x1b4))/0x8*(parseInt(_0x59ab59(0x1a9))/0x9)+-parseInt(_0x59ab59(0x173))/0xa;if(_0x1ed9a4===_0x303457)break;else _0x6aeb92['push'](_0x6aeb92['shift']());}catch(_0x2e3f45){_0x6aeb92['push'](_0x6aeb92['shift']());}}}(_0x1f45,0xe0074));let pTi=document[_0x3b5060(0x174)]('#rehead')[_0x3b5060(0x188)][_0x3b5060(0x182)]('\x20');function relatedRandom(_0x31d535){var _0x20a29b=_0x3b5060;if(document[_0x20a29b(0x174)]('.QNAS')){var _0x193b98=shuffleArray(_0x31d535[_0x20a29b(0x17e)]['entry']),_0x42919e,_0x1541d5,_0x4cae0a='',_0x442533=document[_0x20a29b(0x174)](_0x20a29b(0x190));for(var _0x14094d=0x0;_0x14094d<_0x31d535[_0x20a29b(0x17e)][_0x20a29b(0x1a2)][_0x20a29b(0x19d)];_0x14094d++){for(var _0x53178c=0x0;_0x53178c<_0x31d535[_0x20a29b(0x17e)][_0x20a29b(0x1a2)]['length'];_0x53178c++){if(_0x193b98[_0x14094d]['link'][_0x53178c][_0x20a29b(0x1b2)]==_0x20a29b(0x19e)){_0x1541d5=_0x193b98[_0x14094d][_0x20a29b(0x19a)][_0x53178c][_0x20a29b(0x1a5)];break;}}var _0x42919e=_0x193b98[_0x14094d][_0x20a29b(0x18a)]['$t'];_0x4cae0a+=_0x20a29b(0x181)+_0x1541d5+_0x20a29b(0x1a7)+_0x42919e+'\x27>'+_0x42919e+'</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27'+_0x1541d5+_0x20a29b(0x186)+_0x42919e+_0x20a29b(0x185);}_0x442533['innerHTML']=_0x4cae0a;}}function qnaP(_0x43639c){var _0x3b7ef6=_0x3b5060;if(document[_0x3b7ef6(0x174)](_0x3b7ef6(0x178))){var _0x276635=shuffleArray(_0x43639c['feed'][_0x3b7ef6(0x1a2)]),_0x14ebf6,_0x2f84e1,_0x1a7388='',_0x554baf=document[_0x3b7ef6(0x174)](_0x3b7ef6(0x178));for(var _0x1c8094=0x0;_0x1c8094<_0x43639c[_0x3b7ef6(0x17e)]['entry'][_0x3b7ef6(0x19d)];_0x1c8094++){for(var _0x23ccb4=0x0;_0x23ccb4<_0x43639c[_0x3b7ef6(0x17e)][_0x3b7ef6(0x1a2)][_0x3b7ef6(0x19d)];_0x23ccb4++){if(_0x276635[_0x1c8094][_0x3b7ef6(0x19a)][_0x23ccb4][_0x3b7ef6(0x1b2)]==_0x3b7ef6(0x19e)){_0x2f84e1=_0x276635[_0x1c8094][_0x3b7ef6(0x19a)][_0x23ccb4]['href'];break;}}var _0x14ebf6=_0x276635[_0x1c8094][_0x3b7ef6(0x18a)]['$t'];_0x1a7388+='<li\x20class=\x27item-title\x20ni\x27><a\x20href=\x27'+_0x2f84e1+_0x3b7ef6(0x1a7)+_0x14ebf6+'\x27>'+_0x14ebf6+_0x3b7ef6(0x17f)+_0x2f84e1+_0x3b7ef6(0x186)+_0x14ebf6+_0x3b7ef6(0x185);}_0x554baf[_0x3b7ef6(0x188)]=_0x1a7388;}}function shuffleArray(_0x2d76e8){var _0x2dd4ab=_0x3b5060,_0x28b478=_0x2d76e8['length'],_0x203c2b,_0x27ee48;if(_0x28b478===0x0)return![];while(--_0x28b478){_0x203c2b=Math['floor'](Math[_0x2dd4ab(0x176)]()*(_0x28b478+0x1)),_0x27ee48=_0x2d76e8[_0x28b478],_0x2d76e8[_0x28b478]=_0x2d76e8[_0x203c2b],_0x2d76e8[_0x203c2b]=_0x27ee48;}return _0x2d76e8;}function _0x1f45(){var _0x380a2c=['35883kFXLzE','getAttribute','getHours','getSeconds','3JRnhvO','item-title','3856715OprDzP','&callback=relatedRandom','?rel=favorite','rel','createElement','1512PYuvja','removeChild','3991340mHXGge','querySelector','click','random','script','.QNA','target','includes','1295IzOqZI','getElementsByTagName','src','feed','</a><a\x20class=\x27favoriteL\x27\x20data-url=\x27','appendChild','<li\x20class=\x27tPost\x20ni\x27><a\x20href=\x27','split','getItem','&callback=qnaP','\x27\x20onclick=\x27addItem(this)\x27\x20rel=\x27bookmark\x27><svg\x20class=\x27favoriteP\x27\x20viewBox=\x270\x200\x2024\x2024\x27><path\x20d=\x27M18.4,20.8,12,16,5.6,20.8A1,1,0,0,1,4,20V4A2,2,0,0,1,6,2H18a2,2,0,0,1,2,2V20A1,1,0,0,1,18.4,20.8Z\x27></path></svg></a></li>','\x27\x20data-title=\x27','classList','innerHTML','https://ask.3schools.in/feeds/posts/default?alt=json&max-results=14&q=','title','#list','811284iqtPrn','favoriteL','getMonth','\x22\x20xmlns=\x22http://www.w3.org/2000/svg\x22\x20aria-hidden=\x22true\x22\x20role=\x22img\x22\x20width=\x221em\x22\x20height=\x221em\x22\x20preserveAspectRatio=\x22xMidYMid\x20meet\x22\x20viewBox=\x220\x200\x2020\x2020\x22><path\x20fill=\x22currentColor\x22\x20d=\x22M8.5\x204h3a1.5\x201.5\x200\x200\x200-3\x200Zm-1\x200a2.5\x202.5\x200\x200\x201\x205\x200h5a.5.5\x200\x200\x201\x200\x201h-1.054l-1.194\x2010.344A3\x203\x200\x200\x201\x2012.272\x2018H7.728a3\x203\x200\x200\x201-2.98-2.656L3.554\x205H2.5a.5.5\x200\x200\x201\x200-1h5ZM9\x208a.5.5\x200\x200\x200-1\x200v6a.5.5\x200\x200\x200\x201\x200V8Zm2.5-.5a.5.5\x200\x200\x200-.5.5v6a.5.5\x200\x200\x200\x201\x200V8a.5.5\x200\x200\x200-.5-.5Z\x22/></svg>\x20','.QNAS','6056620CKBEpY','text','filter','push','div','getFullYear','getDate','head','map','link','stringify','1880096HcTlEd','length','alternate','<svg\x20class=\x22favoriteP\x22\x20del-date=\x22','url','setItem','entry','parse','942LZIxfe','href','indexOf','\x27\x20title=\x27','dataset'];_0x1f45=function(){return _0x380a2c;};return _0x1f45();}let relR=document[_0x3b5060(0x1b3)](_0x3b5060(0x177));relR['src']=_0x3b5060(0x189)+pTi[Math['floor'](Math[_0x3b5060(0x176)]()*pTi['length'])]+_0x3b5060(0x1b0),document['getElementsByTagName'](_0x3b5060(0x198))[0x0][_0x3b5060(0x180)](relR);let relP=document[_0x3b5060(0x1b3)]('script');relP[_0x3b5060(0x17d)]=_0x3b5060(0x189)+pTi[Math['floor'](Math[_0x3b5060(0x176)]()*pTi[_0x3b5060(0x19d)])]+_0x3b5060(0x184),document[_0x3b5060(0x17c)](_0x3b5060(0x198))[0x0][_0x3b5060(0x180)](relP);function addItem(_0x167247){var _0x38294d=_0x3b5060;let _0x493948=localStorage['getItem']('my'),_0x340c38=[];_0x493948&&(_0x340c38=JSON[_0x38294d(0x1a3)](_0x493948));var _0xce342f=new Date(),_0x361229=_0xce342f[_0x38294d(0x197)]()+'-'+(_0xce342f[_0x38294d(0x18e)]()+0x1)+'-'+_0xce342f[_0x38294d(0x196)](),_0xf997b8=_0xce342f[_0x38294d(0x1ab)]()+':'+_0xce342f['getMinutes']()+':'+_0xce342f[_0x38294d(0x1ac)]();_0x340c38[_0x38294d(0x194)]({'id':_0x361229+'\x20'+_0xf997b8,'title':_0x167247[_0x38294d(0x1a8)][_0x38294d(0x18a)],'url':_0x167247[_0x38294d(0x1a8)][_0x38294d(0x1a0)]});const _0x1330d7=_0x340c38['map'](_0x2e04c2=>_0x2e04c2[_0x38294d(0x1a0)]),_0xe21e51=_0x340c38[_0x38294d(0x193)](({url:_0x537924},_0x43b43f)=>!_0x1330d7[_0x38294d(0x17a)](_0x537924,_0x43b43f+0x1));localStorage[_0x38294d(0x1a1)]('my',JSON[_0x38294d(0x19b)](_0xe21e51)),addtof();}function addtof(){var _0xe290c7=_0x3b5060;let _0x349243=document[_0xe290c7(0x174)](_0xe290c7(0x18b));_0x349243&&(_0x349243[_0xe290c7(0x188)]='');var _0x42fe85=[];let _0x362b6e=localStorage[_0xe290c7(0x183)]('my');_0x42fe85=JSON[_0xe290c7(0x1a3)](_0x362b6e),_0x42fe85['forEach'](function(_0x7e2e7c){var _0xfecf9e=_0xe290c7,_0x30d597=document['createElement']('li'),_0x4a8ce0=document[_0xfecf9e(0x1b3)]('a'),_0x5d137e=document['createElement'](_0xfecf9e(0x195));_0x5d137e[_0xfecf9e(0x188)]=_0xfecf9e(0x19f)+_0x7e2e7c['id']+_0xfecf9e(0x18f),_0x5d137e[_0xfecf9e(0x187)]=_0xfecf9e(0x18d),_0x5d137e['onclick']=_0x503316,_0x4a8ce0[_0xfecf9e(0x1a5)]=_0x7e2e7c[_0xfecf9e(0x1a0)]+_0xfecf9e(0x1b1),_0x4a8ce0[_0xfecf9e(0x192)]=_0x7e2e7c[_0xfecf9e(0x18a)],_0x30d597[_0xfecf9e(0x187)]=_0xfecf9e(0x1ae),_0x30d597['appendChild'](_0x4a8ce0),_0x30d597['appendChild'](_0x5d137e),_0x349243[_0xfecf9e(0x180)](_0x30d597);function _0x503316(_0x507451){var _0x59c442=_0xfecf9e;let _0x3af769=document[_0x59c442(0x174)]('#list');_0x3af769[_0x59c442(0x172)](_0x30d597),_0x3af769['addEventListener'](_0x59c442(0x175),function(_0x4f6fb5){var _0x342c25=_0x59c442,_0x4c81b3=_0x4f6fb5[_0x342c25(0x179)][_0x342c25(0x1aa)]('del-date');let _0x5e153a=_0x42fe85[_0x342c25(0x199)](_0x57a5c7=>_0x57a5c7['id'])[_0x342c25(0x1a6)](_0x4c81b3);_0x42fe85['splice'](_0x5e153a,0x1),localStorage[_0x342c25(0x1a1)]('my',JSON[_0x342c25(0x19b)](_0x42fe85));});}});}addtof();
function record(v){
recognition.start();
recognition.onresult = event => {
  const speechToText = event.results[event.results.length - 1][0];
  let text = speechToText.transcript;
if(v!=1){
document.querySelector(".cE").innerHTML += text;
}else{

document.querySelector("#search-input").value = text;
  if (
    text.indexOf("তোমার নাম") >= 0 ||
    text.indexOf("তুমি কে") >= 0||
    text.indexOf("আপনার নাম") >= 0||
    text.indexOf("ওকে গুগল") >= 0||
    text.indexOf("হু আর ইউ") >= 0||
    text.indexOf("হোয়াট ইজ ইওর নেম") >= 0
  ) {
    speak(" ওহো, আমি নিজের পরিচয় দিতে ভুলে গেছি, হাই, আমার নাম অপু। ।।তোমার নাম কী? ");
  }else if (
    text.indexOf("হাই") >= 0 ||
    text.indexOf("হ্যালো") >= 0||
    text.indexOf("হেল্প মি") >= 0||
    text.indexOf("ওকে অপু") >= 0
  ) {
    speak(" নমস্কার ,আজ আপনাকে কিভাবে সাহায্য করতে পারি? ");
  } else if (
    text.indexOf("আমার নাম কি") >= 0 ||
    text.indexOf("আমি কে") >= 0||
    text.indexOf("আমার নাম ডাকো") >= 0||
    text.indexOf("আমার নাম বল") >= 0
  ) {
    speak("আমি তো জানি আপনার নাম কি, আপনি বলুন তো আপনার নাম কি? ");
  }
  
  else if (text.indexOf("সার্চ") >= 0) {
   
    let q = text.substr(text.indexOf("সার্চ") + 5);
speak(` আক্স থ্রি স্কুলসে সার্চ করা হল ${q}`);
    window.open(`https://ask.3schools.in/search?q=${q}`,`_self`);
  } else if (
    text.indexOf("টাইম") >= 0 ||
    text.indexOf("কয়টা বাজে") >= 0 ||
    text.indexOf("কয়টা বাজ") >=0 ||
    text.indexOf("কটা বাজ") >= 0 ||
    text.indexOf("সময়") >= 0 ||
    text.indexOf("হোয়াট ইজ দা টাইম") >=0
  ) {
    let t = currentTime();
    speak(t);
  } else if (text.indexOf("আমার নাম") >= 0) {
let name = text.substr(text.indexOf("নাম") + 3); // Split name from text
    speak(`হ্যালো...হ্যাল্লো! ${name} আশা করি আজকের দিনটা আপনার খুব ভালো  কাটছে। আমি কিভাবে সাহায্য করতে পারি ,বলুন? `);
  } else if(
    text.indexOf("ছেলে নাকি মেয়ে") >= 0 ||
    text.indexOf("কি ছেলে") >=0 ||
    text.indexOf("কি মেয়ে") >=0 ||
    text.indexOf("ছেলে না মেয়ে") >= 0 
    ) {
    speak("আপনার পরাণ যাহা চায় .....আমি তাই, আমি তাই গো,💗" );
  } else if (
    text.indexOf("গুডবাই") >= 0||
    text.indexOf("বাই") >= 0||
    text.indexOf("রাখ") >= 0 ||
    text.indexOf("ঠিক আছে ") >= 0 ||
    text.indexOf("আমি কিন্তু রেগে যাচ্ছি") >= 0 ||
    text.indexOf("চুপ") >= 0
    ){
    speak("ঠিক আছে, আমি চুপ করে যাচ্ছি!");
  } else if (
    text.indexOf("তোমার সাথে কথা বলব না") >= 0 ||
    text.indexOf("তুমি কথা বলতে পারো না।") >= 0 ||
    text.indexOf("আই হেট ইউ") >=0 ||
    text.indexOf("বেকার") >=0 ||
    text.indexOf("কোন লাভ নেই") >=0 ||
    text.indexOf("তুমি খারাপ") >= 0
  ) {
    speak(` দুঃখিত, আমি কী কিছু ভুল করে ফেলেছি? এখনো আমি পুরোপুরি সব শিখিনি।`);
  }else if (
    text.indexOf("কী পার") >=0 ||
    text.indexOf("সাহায্য কর") >=0 ||
    text.indexOf("কি কি পার") >=0 ||
    text.indexOf("কি কি করতে") >=0 ||
    text.indexOf("কি করতে পার") >=0 ||
    text.indexOf("তোমার কাজ") >=0 ||
    text.indexOf("আপনার কাজ") >=0 ||
    text.indexOf("হাউ ক্যান ইউ হেল্প") >=0 ||
    text.indexOf("হেল্প কর") >=0 
    ) {
    speak(cando());
    }
  else if (
    text.indexOf("ওপেন ইউটিউব") >=0 ||
    text.indexOf("ইউটিউব খুলুন") >=0 ||
    text.indexOf("ভিডিও") >=0 ||
    text.indexOf("ইউটিউব ওপেন করো") >=0 ||
    text.indexOf("ইউটিউব") >=0 
    ) {
    speak(`খুলছি ইউটিউব`);
    window.open(`https://youtube.com/`,`_self`);
  } else if (
    text.indexOf("ওপেন হোয়াটসঅ্যাপ") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ খুলুন") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ ওপেন করো") >=0 ||
    text.indexOf("হোয়াটসঅ্যাপ") >=0 
    ) {
    speak(`খুলছি হোয়াটসঅ্যাপ`);
    window.open(`https://api.whatsapp.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন ফেসবুক") >=0 ||
    text.indexOf("ফেসবুক খুলুন") >=0 ||
    text.indexOf("ফেসবুক ওপেন করো") >=0 ||
    text.indexOf("ফেসবুক") >=0 
    ) {
    speak(`খুলছি ফেসবুক`);
    window.open(`https://www.facebook.com/`,`_self`);
  }else if (
    text.indexOf("ওপেন টেলিগ্রাম ") >=0 ||
    text.indexOf("টেলিগ্রাম খুলুন") >=0 ||
    text.indexOf("টেলিগ্রাম ওপেন করো") >=0 ||
    text.indexOf("টেলিগ্রাম") >=0 
    ) {
    speak(`খুলছি টেলিগ্রাম`);
    window.open(`https://www.telegram.me`,`_self`);
  } else if (
    text.indexOf("বিয়ে") >=0 ||
    text.indexOf("আমি তোমাকে ভালোবাসি") >=0 ||
    text.indexOf("আই লাভ ইউ") >=0 ||
    text.indexOf("আমার বিয়ে কবে") >=0 
    ) {
    speak(`যতই করুন বাহানা, যতই বলুন না না না, বিয়ের ফুল ফুঁটলেই বাজবে বিয়ের বাজনা`);
  } else if (
    text.indexOf("তারিখ কত") >= 0 ||
    text.indexOf("আজ কত তারিখ") >= 0 ||
    text.indexOf("বাংলা কত তারিখ") >= 0 ||
    text.indexOf("ইংলিশের কত তারিখ") >= 0 ||
    text.indexOf("ক্যালেন্ডার") >= 0 ||
    text.indexOf("আজকের তারিখ") >= 0 ||
    text.indexOf("এখন কত সাল") >= 0 ||
    text.indexOf("এখন কত খ্রিস্টাব্দ") >= 0 ||
    text.indexOf("আজকে কি বার") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("ডেট") >= 0 ||
    text.indexOf("টুডে") >= 0
  ) {
    speak(currentDate());
  }else if (
    text.indexOf("সাত দিনের নাম") >= 0 ||
    text.indexOf("সপ্তাহ") >= 0 ||
    text.indexOf("রবিবার") >= 0 ||
    text.indexOf("সোমবার") >= 0
  ) {
    speak(`রবিবার,সোমবার,মঙ্গলবার,বুধবার,বৃহস্পতিবার,শুক্রবার,শনিবার`);
  }else if (
    text.indexOf("জোকস") >= 0 ||
    text.indexOf("আরও একটা") >= 0 ||
    text.indexOf("জোক") >= 0 ||
    text.indexOf("মজা") >= 0 
  ) {
    speak(jokes());
  }else if (
    text.indexOf("গাল") >= 0 ||
    text.indexOf("কুত্তা") >= 0 ||
    text.indexOf("পাদ") >= 0 ||
    text.indexOf("হারামজাদা") >= 0 ||
    text.indexOf("হারামখোর") >= 0 ||
    text.indexOf("কুত্তার") >= 0 ||
    text.indexOf("হারামি") >= 0 ||
    text.indexOf("শালা") >= 0 ||
    text.indexOf("চুদ") >= 0 ||
    text.indexOf("নোংরা") >= 0 ||
    text.indexOf("শুয়োর") >= 0
  ) {
    speak(`আমার গাল নেই তাই গালাগালি দিতে পারি না।`) ;
  }else if (
    text.indexOf("গান") >= 0 ||
    text.indexOf("মিউজিক") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("নাচ") >= 0
  ) {
    speak(`আমার গলা ঠিক নেই, তাই আজ আমি গান গাইতে পারব না।`) ;
  }
  
  else if (
    text.indexOf("শোনা") >= 0 ||
    text.indexOf("পোয়েম") >= 0 ||
    text.indexOf("গাও") >= 0 ||
    text.indexOf("সাইরি") >= 0 ||
    text.indexOf("কবিতা বল") >= 0 ||
    text.indexOf("ছোটোদের") >= 0
  ) {
    speak(poem());
  }else if (
    text.indexOf("আমার মন খারাপ") >= 0 ||
    text.indexOf("দুঃখে আছ") >= 0 ||
    text.indexOf("আমি ভালো নেই") >= 0
  ) {
    speak(`আমার সাধ্য থাকলে আমি আপনার সমস্ত দুঃখ শুষে নিয়ে আপনাকে আনন্দ দিয়ে ভরিয়ে দিতাম`);
  }else if (
    text.indexOf("হাউ আর ইউ") >=0 ||
    text.indexOf("আশা করি") >= 0 ||
    text.indexOf("ভালো আছ") >= 0 ||
    text.indexOf("কেমন আছ") >= 0
  ) {
    speak(`ধন্যবাদ । আমি ভালো আছি । আপনাকে কীভাবে সাহায্য করতে পারি বলুন ।`);
  } else if (
    text.indexOf("অ্যালেক্সা") >=0 ||
    text.indexOf("আলেক্সা") >= 0 ||
    text.indexOf("এলেক্স") >= 0 ||
    text.indexOf("আলেক্স") >= 0
  ) {
    speak(`অ্যালেক্সা, শুনেছি অ্যামাজনে থাকে। খুব সুন্দর গলা ওর। আমার দারুণ লাগে। `);
  }else if (
    text.indexOf("গুগল অ্যাসিস্ট্যান্ট") >=0 ||
    text.indexOf("অ্যাসিস্ট্যান্ট") >= 0 ||
    text.indexOf("গুগল এসিস্ট্যান্ট") >= 0
  ) {
    speak(`গুগল অ্যাসিস্ট্যান্ট, ও খুব বুদ্ধিমান । আমাকে নতুন কিছু শিখতে ও সাহায্য করে । আমার তো ওকে দারুণ লাগে। `);
  } else if (
    text.indexOf("কি করছো") >= 0 ||
    text.indexOf("কি হচ্ছে") >= 0 ||
    text.indexOf("কি চলছে") >= 0 ||
    text.indexOf("কি করেন") >= 0 ||
    text.indexOf("কি করছি") >= 0 ||
    text.indexOf("ফাঁকা আছ") >= 0 
  ) {
    speak(whatdo());
  }else if (
    text.indexOf("ধন্যবাদ") >= 0 ||
    text.indexOf("খুব ভালো") >= 0 ||
    text.indexOf("থ্যাংক ইউ") >= 0 ||
    text.indexOf("বুদ্ধিমান") >= 0 ||
    text.indexOf("থ্যাঙ্ক ইউ") >= 0 ||
    text.indexOf("ভালো লাগলো") >= 0 
  ) {
    speak(thankyou());
  }
  
  else {
    speak(`আক্স থ্রি স্কুলসে আমি এইগুলো খুজে পেয়েছি`);
    document.querySelector("#search-form").submit();
  }
};

}
}
function currentTime() {
  let date = new Date();
  return `এখন সময় ${date.getHours()} ${date.getMinutes()} ${
    date.getHours() >= 12 ? "PM" : "AM"
  }`;
}
function currentDate(){
 const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];
 //const days = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"];
 const days = ["রবিবার","সোমবার","মঙ্গলবার","বুধবার","বৃহস্পতিবার","শুক্রবার","শনিবার"];
 let d = new Date();
 return `আজকে ${days[d.getDay()]} , ${d.getDate()} ${monthNames[d.getMonth()]}, ${d.getFullYear()}`;
}
function jokes(){
   const joke = [
    "কোন রসগোল্লা একেবারে মিষ্টি নয়? পরীক্ষার খাতায় পাওয়া রসগোল্লা।", 
    "শিক্ষক ছাত্রকে বললেন - জানো, বই কত পবিত্র জিনিস? ছাত্র বললো, জানি বৈকি স্যার , তাই তো সবসময় স্পর্শ,করি না। ", 
    "রেজাল্ট বেরোনোর পরে খুব রেগে গিয়ে মা ডাবলুকে বললেন, পাশের বাড়ির মেয়েটাকে দ্যাখ, প্রত্যেকবার ক্লাসে ফাস্ট হয়। ডাবলু বললো, ওকে রোজ দেখতে গিয়েই তো আমি ফেল করলাম। ", 
    ]
    return `${joke[Math.floor(Math.random()*joke.length)]}`;
}
function poem(){
  const poems = [
    "আমাদের ছোট নদী- রবীন্দ্রনাথ ঠাকুর , আমাদের ছোটো নদী চলে আঁকে বাঁকে বৈশাখ মাসে তার হাঁটু জল থাকে। পার হয়ে যায় গোরু, পার হয় গাড়ি, দুই ধার উঁচু তার, ঢালু তার পাড়ি।", 
    " আকাশ ঘিরে মেঘ করেছে ,সূর্যি গেছে পাঠে ।খুকু গেলো জল আনিতে পদ্মা দীঘির ঘাটে।পদ্মা দীঘির কালো জলে হরেক রকম ফুল। হাঁটুর নিচে ঝুলছে খুকুর গোছা ভরা চুল।", 
    " বনে থাকে বাঘ । গাছে থাকে পাখি । জলে থাকে মাছ । ডালে আছে ফল । পাখি ফল খায় । পাখা মেলে ওড়ে যায়।  ", 
    "ছয়টি ঋতু, বারো মাসে, বাংলা বর্ষে যায় আর আসে। ছয় ঋতুতেই এই প্রকৃতি, সাজে নানান রূপ আর রসে। ",
    "হাট্টিমাটিম টিম। তারা মাঠে পাড়ে ডিম, তাদের খাড়া দুটো শিং, তারা হাট্টিমাটিম টিম।",
    "টুইংকল টুইংকল লিটল স্টার, হাউ আর ওয়ান্ডার হোয়াট ইউ আর। আপ এভাব দ্যা ওয়ার্ল্ড সো হাই। লাইক এ ডায়মন্ড ইন দ্যা স্কাই", 
    ]
    return `${poems[Math.floor(Math.random()*poems.length)]}`;
}
function whatdo(){
   const whatdo = [
    "নিজের রসিকতায় নিজেই হাসছি, ভাবছি আরও কিছু জোকস পড়ব ।", 
    "আমি কিছু ইন্টারেস্টিং তথ্য নিয়ে পড়াশোনা করে নিজের জ্ঞান বাড়াচ্ছি। ", 
    "আপনার সাথে আড্ডা মারবো ভাবছিলাম। ", 
    ]
    return `${whatdo[Math.floor(Math.random()*whatdo.length)]}`;
}
function cando(){
   const cando = [
    "আমি আপনাকে প্রশ্ন ও উত্তর সন্ধান করতে সাহায্য করতে পারি।", 
    "আমাকে শুধু মাত্র বলে দেখুন, এখন কটা বাজছে, আজকে কি বার , একটা জোক শোনাও ,ইত্যাদি । ", 
    "আপনি চাইলে, আমি আপনার সাথে আড্ডা মারতেও পারি। ", 
    ]
    return `${cando[Math.floor(Math.random()*cando.length)]}`;
}
function thankyou(){
   const thank = [
    "ওউওউওউ, ধন্যবাদের কী আছে, এটাই তো আমার কাজ।", 
    "বন্ধুকে কি কেউ ধন্যবাদ দেয়। ", 
    "আপনাকে সাহায্য করতে পেরে আমি খুব খুশি। ", 
    ]
    return `${thank[Math.floor(Math.random()*thank.length)]}`;
}

function speak(text) {
  recognition.stop();
  let msg = new SpeechSynthesisUtterance(text);
  window.speechSynthesis.speak(msg);
  return;
}
